[{
    "category": "Popular Jokes", 
    "text": "Yo momma is so fat, I took a picture of her last Christmas and it's still printing.", 
    "identifier": "joke_6051Popular Jokes", 
    "dislikes": 9290, 
    "likes": 40513
},
{
    "category": "Popular Jokes", 
    "text": "Yo momma is so fat when she got on the scale it said, \"I need your weight not your phone number.\"", 
    "identifier": "joke_6052Popular Jokes", 
    "dislikes": 8557, 
    "likes": 33965
},
{
    "category": "Popular Jokes", 
    "text": "Yo momma is so fat that when she went to the beach a whale swam up and sang, \"We are family, even though you're fatter than me.\"", 
    "identifier": "joke_6054Popular Jokes", 
    "dislikes": 8612, 
    "likes": 25115
},
{
    "category": "Popular Jokes", 
    "text": "Yo mamma is so ugly when she tried to join an ugly contest they said, \"Sorry, no professionals.\"", 
    "identifier": "joke_6034Popular Jokes", 
    "dislikes": 7006, 
    "likes": 24359
},
{
    "category": "Popular Jokes", 
    "text": "Yo momma's so fat and old when God said, \"Let there be light,\" he asked your mother to move out of the way.", 
    "identifier": "joke_5989Popular Jokes", 
    "dislikes": 7613, 
    "likes": 21559
},
{
    "category": "Latest Jokes", 
    "text": "Your mama is so ugly that when I told her to do the robot, R2-D2 got herpes.", 
    "identifier": "joke_21564Latest Jokes", 
    "dislikes": 221, 
    "likes": 117
},
{
    "category": "Latest Jokes", 
    "text": "Paddy and Murphy are havin' a pint in the pub, when some scuba divers come on the TV. Paddy says, \"Murphy, why is it them deep sea divers always sit on the side of the boat with them air tanks on their backs, and fall backwards out of the boat?\" Murphy thinks for a minute then says, \"That's easy. It's 'cos if they fell forwards, they'd still be in the friggin boat!\"", 
    "identifier": "joke_21553Latest Jokes", 
    "dislikes": 67, 
    "likes": 130
},
{
    "category": "Latest Jokes", 
    "text": "Q: Why couldn't the leopard play hide and seek? A: Because he was always spotted.", 
    "identifier": "joke_21536Latest Jokes", 
    "dislikes": 74, 
    "likes": 252
},
{
    "category": "Latest Jokes", 
    "text": "There's a blond and a brunette in a car. The brunette is driving while the blonde is in the passenger seat. They're going down a steep hill when the brunette realizes that the brakes don't work. The brunette tells the blonde that the brakes don't work and they will drive off the side of the cliff because they failed to stop. The blonde then replies, \"Don't worry! There's a stop sign ahead.\"", 
    "identifier": "joke_21525Latest Jokes", 
    "dislikes": 94, 
    "likes": 169
},
{
    "category": "Latest Jokes", 
    "text": "There were two cannibals who captured a man. They decided it would be fair if they started eating from opposite ends. After a few minutes, the one who started at the head asked the other one, \"How's it going down there?\" And the other one replies, \"I'm having a ball!\"", 
    "identifier": "joke_21471Latest Jokes", 
    "dislikes": 74, 
    "likes": 151
},
{
    "category": "Latest Jokes", 
    "text": "There was once a blonde woman on a plane to Detroit. She was in the economy class, but after takeoff, she saw an empty seat in first class and moved there. An attendant saw her and said, \"Excuse me, ma'am, but you have a ticket for economy class, not first. You cannot stay here.\" The blonde replied, \"I can and I will.\" The attendant told the copilot, who came and talked to the woman. \"Ma'am, we really can't have you staying in this seat, your ticket was for economy.\" \"You can't make me move.\" The copilot told the captain, who tried to talk her out of the seat but it didn't work. Finally, a man who had heard what had been going on told the attendant to let him have a go at getting the woman out of the seat because he was married to a blonde too, so he knew how to deal with her. After a quick chat with her, she moved. The shocked attendant asked him how he did it. The man replied, \"I told her first class wasn't going to Detroit.\"", 
    "identifier": "joke_21449Latest Jokes", 
    "dislikes": 41, 
    "likes": 206
},
{
    "category": "Latest Jokes", 
    "text": "Q: Why can't orphans play baseball? A: Because they don't know where home is.", 
    "identifier": "joke_21432Latest Jokes", 
    "dislikes": 134, 
    "likes": 72
},
{
    "category": "Latest Jokes", 
    "text": "The words election and erection are spelled similarly. They both have the same meaning too: a dick rising to power.", 
    "identifier": "joke_21417Latest Jokes", 
    "dislikes": 34, 
    "likes": 90
},
{
    "category": "Latest Jokes", 
    "text": "Q: Why did Adele cross the road? A: To sing, \"Hello from the other side!\"", 
    "identifier": "joke_21414Latest Jokes", 
    "dislikes": 100, 
    "likes": 282
},
{
    "category": "Latest Jokes", 
    "text": "Yo mamma's so stupid, she thought Free Willy was a porno film.", 
    "identifier": "joke_21403Latest Jokes", 
    "dislikes": 139, 
    "likes": 111
},
{
    "category": "Latest Jokes", 
    "text": "Q. What can you give and keep at the same time? A. A cold!", 
    "identifier": "joke_21384Latest Jokes", 
    "dislikes": 75, 
    "likes": 157
},
{
    "category": "Latest Jokes", 
    "text": "''Doctor, my nose is 11 inches long!\" ''Come back when it grows into a foot!\"", 
    "identifier": "joke_21383Latest Jokes", 
    "dislikes": 92, 
    "likes": 93
},
{
    "category": "Latest Jokes", 
    "text": "Q. What did the pop star do when he locked himself out? A. He sang until he found the right key!", 
    "identifier": "joke_21381Latest Jokes", 
    "dislikes": 88, 
    "likes": 169
},
{
    "category": "Latest Jokes", 
    "text": "Q. Why do anime fans listen to the radio in the morning? A. Because they enjoy car toons!", 
    "identifier": "joke_21379Latest Jokes", 
    "dislikes": 127, 
    "likes": 90
},
{
    "category": "Latest Jokes", 
    "text": "Q. Why did the apple run away? A. Because the banana split!", 
    "identifier": "joke_21378Latest Jokes", 
    "dislikes": 82, 
    "likes": 171
},
{
    "category": "Latest Jokes", 
    "text": "Q. What is the color of the wind? A. Blew.", 
    "identifier": "joke_21377Latest Jokes", 
    "dislikes": 58, 
    "likes": 189
},
{
    "category": "Latest Jokes", 
    "text": "Q. What's a shark's favorite sandwich? A. Peanut butter and jellyfish!", 
    "identifier": "joke_21375Latest Jokes", 
    "dislikes": 50, 
    "likes": 80
},
{
    "category": "Latest Jokes", 
    "text": "Yo mama's hair is so full of dandruff, when she shook her head, the principal called a snow day.", 
    "identifier": "joke_21347Latest Jokes", 
    "dislikes": 73, 
    "likes": 141
},
{
    "category": "Latest Jokes", 
    "text": "Have you heard the story of the magic sandwich? Never mind, it's just a bunch of bologna.", 
    "identifier": "joke_21304Latest Jokes", 
    "dislikes": 120, 
    "likes": 114
},
{
    "category": "Latest Jokes", 
    "text": "Q: What do you get when you cross a fish and an elephant? A: Swimming trunks.", 
    "identifier": "joke_21299Latest Jokes", 
    "dislikes": 93, 
    "likes": 166
},
{
    "category": "Joke of the Day", 
    "text": "A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\" Featured on June 08, 2016", 
    "identifier": "joke_5300Joke of the Day", 
    "dislikes": 1354, 
    "likes": 5050
},
{
    "category": "Animal Jokes", 
    "text": "What happens to a frog's car when it breaks down? It gets toad away.", 
    "identifier": "joke_6982Animal Jokes", 
    "dislikes": 4160, 
    "likes": 12040
},
{
    "category": "Animal Jokes", 
    "text": "Q: What did the duck say when he bought lipstick? A: \"Put it on my bill.\"", 
    "identifier": "joke_6759Animal Jokes", 
    "dislikes": 3149, 
    "likes": 7522
},
{
    "category": "Animal Jokes", 
    "text": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"", 
    "identifier": "joke_3272Animal Jokes", 
    "dislikes": 1615, 
    "likes": 6172
},
{
    "category": "Animal Jokes", 
    "text": "Q. What did the elephant say to the naked man? A. \"How do you breathe through something so small?\"", 
    "identifier": "joke_6147Animal Jokes", 
    "dislikes": 1837, 
    "likes": 3214
},
{
    "category": "Animal Jokes", 
    "text": "There was a papa mole, a momma mole, and a baby mole. They lived in a hole out in the country near a farmhouse. Papa mole poked his head out of the hole and said, \"Mmmm, I smell sausage!\" Momma mole poked her head outside the hole and said, \"Mmmm, I smell pancakes!\" Baby mole tried to stick his head outside but couldn't because of the two bigger moles. Baby mole said, \"The only thing I smell is molasses.\"", 
    "identifier": "joke_3791Animal Jokes", 
    "dislikes": 1246, 
    "likes": 2348
},
{
    "category": "Blonde Jokes", 
    "text": "A blonde, a redhead, and a brunette were all lost in the desert. They found a lamp and rubbed it. A genie popped out and granted them each one wish. The redhead wished to be back home. Poof! She was back home. The brunette wished to be at home with her family. Poof! She was back home with her family. The blonde said, \"Awwww, I wish my friends were here.\"", 
    "identifier": "joke_5994Blonde Jokes", 
    "dislikes": 2049, 
    "likes": 15132
},
{
    "category": "Blonde Jokes", 
    "text": "Blonde: \"What does IDK stand for?\" Brunette: \"I don’t know.\" Blonde: \"OMG, nobody does!\"", 
    "identifier": "joke_5784Blonde Jokes", 
    "dislikes": 2118, 
    "likes": 12460
},
{
    "category": "Blonde Jokes", 
    "text": "Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\"", 
    "identifier": "joke_5767Blonde Jokes", 
    "dislikes": 1584, 
    "likes": 11767
},
{
    "category": "Blonde Jokes", 
    "text": "Q: Why can't a blonde dial 911? A: She can't find the eleven.", 
    "identifier": "joke_5969Blonde Jokes", 
    "dislikes": 1846, 
    "likes": 10490
},
{
    "category": "Blonde Jokes", 
    "text": "There was a blonde, a redhead, and a brunette. They were all trapped on an island and the nearest shore was 50 miles away. The redhead swam trying to make it to the other shore she swam 15 miles, drowned, and died. The brunette swam 24 miles, drowned, and died. The blonde swam 25 miles, got tired, and swam back.", 
    "identifier": "joke_5993Blonde Jokes", 
    "dislikes": 1720, 
    "likes": 10485
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: How do Chinese people name their babies? A: They throw them down the stairs to see what noise they make.", 
    "identifier": "joke_6236Boycott These Jokes", 
    "dislikes": 2485, 
    "likes": 6214
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: What's the difference between a Jew and a boy scout? A: A boy scout comes home from camp.", 
    "identifier": "joke_6155Boycott These Jokes", 
    "dislikes": 4059, 
    "likes": 4117
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: What's the difference between a black man and a park bench? A: A park bench can support a family of four.", 
    "identifier": "joke_6464Boycott These Jokes", 
    "dislikes": 2640, 
    "likes": 3017
},
{
    "category": "Boycott These Jokes", 
    "text": "How do you starve a black person? Put their food stamp card under their workboots!", 
    "identifier": "joke_6820Boycott These Jokes", 
    "dislikes": 2019, 
    "likes": 1753
},
{
    "category": "Boycott These Jokes", 
    "text": "I was at my bank today waiting in a short line. There was just one lady in front of me, an Asian lady, who was trying to exchange yen for dollars. It was obvious she was a little irritated. She asked the teller, \"Why it change? Yesterday, I get two hunat dolla of yen. Today I only get hunat eighty? Why it change?\" The teller shrugged his shoulders and said, \"Fluctuations.\" The Asian lady says, \"Fluc you white people too!\"", 
    "identifier": "joke_2133Boycott These Jokes", 
    "dislikes": 489, 
    "likes": 1469
},
{
    "category": "Clean Jokes", 
    "text": "Teacher: \"Kids, what does the chicken give you?\" Student: \"Meat!\" Teacher: \"Very good! Now what does the pig give you?\" Student: \"Bacon!\" Teacher: \"Great! And what does the fat cow give you?\" Student: \"Homework!\"", 
    "identifier": "joke_12784Clean Jokes", 
    "dislikes": 10401, 
    "likes": 47655
},
{
    "category": "Clean Jokes", 
    "text": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"", 
    "identifier": "joke_6693Clean Jokes", 
    "dislikes": 5086, 
    "likes": 26109
},
{
    "category": "Clean Jokes", 
    "text": "What happens to a frog's car when it breaks down? It gets toad away.", 
    "identifier": "joke_6982Clean Jokes", 
    "dislikes": 4160, 
    "likes": 12040
},
{
    "category": "Clean Jokes", 
    "text": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.", 
    "identifier": "joke_13516Clean Jokes", 
    "dislikes": 1335, 
    "likes": 8019
},
{
    "category": "Clean Jokes", 
    "text": "Q: What did the duck say when he bought lipstick? A: \"Put it on my bill.\"", 
    "identifier": "joke_6759Clean Jokes", 
    "dislikes": 3149, 
    "likes": 7522
},
{
    "category": "Family Jokes", 
    "text": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"", 
    "identifier": "joke_6693Family Jokes", 
    "dislikes": 5086, 
    "likes": 26109
},
{
    "category": "Family Jokes", 
    "text": "Wife: \"I look fat. Can you give me a compliment?\" Husband: \"You have perfect eyesight.\"", 
    "identifier": "joke_7456Family Jokes", 
    "dislikes": 3635, 
    "likes": 17463
},
{
    "category": "Family Jokes", 
    "text": "A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\"", 
    "identifier": "joke_5300Family Jokes", 
    "dislikes": 1354, 
    "likes": 5050
},
{
    "category": "Family Jokes", 
    "text": "An elderly couple are in church. The wife leans over and whispers to her husband, \"I just let out a long, silent fart. What should I do?\" The husband replies, \"First off, replace the batteries in your hearing aid!\"", 
    "identifier": "joke_1730Family Jokes", 
    "dislikes": 631, 
    "likes": 2837
},
{
    "category": "Family Jokes", 
    "text": "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business & the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\"", 
    "identifier": "joke_11231Family Jokes", 
    "dislikes": 319, 
    "likes": 2480
},
{
    "category": "Food Jokes", 
    "text": "A family is at the dinner table. The son asks the father, “Dad, how many kinds of boobs are there?” The father, surprised, answers, “Well, son, a woman goes through three phases. In her 20s, a woman’s breasts are like melons, round and firm. In her 30s and 40s, they are like pears, still nice, hanging a bit. After 50, they are like onions.” “Onions?” the son asks. “Yes. You see them and they make you cry.” This infuriated his wife and daughter. The daughter asks, “Mom, how many different kinds of willies are there?” The mother smiles and says, “Well, dear, a man goes through three phases also. In his 20s, his willy is like an oak tree, mighty and hard. In his 30s and 40s, it’s like a birch, flexible but reliable. After his 50s, it’s like a Christmas tree.” “A Christmas tree?” the daughter asks. “Yes, dead from the root up and the balls are just for decoration.”", 
    "identifier": "joke_3413Food Jokes", 
    "dislikes": 5714, 
    "likes": 52971
},
{
    "category": "Food Jokes", 
    "text": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"", 
    "identifier": "joke_2006Food Jokes", 
    "dislikes": 4701, 
    "likes": 45521
},
{
    "category": "Food Jokes", 
    "text": "A man kills a deer and takes it home to cook for dinner. Both he and his wife decide that they won't tell the kids what kind of meat it is, but will give them a clue and let them guess. The dad said, \"Well it's what Mommy calls me sometimes.\" The little girl screamed to her brother, \"Don't eat it. Its an asshole!", 
    "identifier": "joke_4599Food Jokes", 
    "dislikes": 1535, 
    "likes": 8418
},
{
    "category": "Food Jokes", 
    "text": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.", 
    "identifier": "joke_13516Food Jokes", 
    "dislikes": 1335, 
    "likes": 8019
},
{
    "category": "Food Jokes", 
    "text": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"", 
    "identifier": "joke_3272Food Jokes", 
    "dislikes": 1615, 
    "likes": 6173
},
{
    "category": "Holiday Jokes", 
    "text": "Q: What do a Christmas tree and a priest have in common? A: Their balls are just for decoration.", 
    "identifier": "joke_6838Holiday Jokes", 
    "dislikes": 2525, 
    "likes": 2818
},
{
    "category": "Holiday Jokes", 
    "text": "It was Christmas Eve. A woman came home to her husband after a day of busy shopping. Later on that night when she was getting undressed for bed, he noticed a mark on the inside of her leg. \"What is that?\" he asked. She said, \"I visited the tattoo parlor today. On the inside of one leg I had them tattoo 'Merry Christmas,' and on the inside of the other one they tattooed 'Happy New Year.'\" Perplexed, he asked, \"Why did you do that?\" \"Well,\" she replied, \"now you can't complain that there's never anything to eat between Christmas and New Years!\"", 
    "identifier": "joke_7641Holiday Jokes", 
    "dislikes": 896, 
    "likes": 2677
},
{
    "category": "Holiday Jokes", 
    "text": "On Thanksgiving day, a little boy overhears his mom and dad fighting. He hears his mom call his dad a bastard and hears his dad call his mom a bitch. He asks, \"Mommy, what does bastard mean?\" She answers, \"Um, it means boy.\" Then he asks, \"Daddy, what does bitch mean?\" He says, \"Uh, it means girl.\" Later that day, the boy sees his father in the bathroom shaving; the dad accidentally cuts himself and says, \"Sh*t.\" The son asks, \"What does that mean?\" The dad says, \"It means shaving cream.\" Then he sees his mom in the kitchen carving the turkey; she accidentally cuts herself and says, \"F*ck.\" The son asks her what that word means and she says, \"It means carving.\" That evening, the family's guests arrive for Thanksgiving dinner. The son opens the door to welcome them and says, \"Welcome bitches and bastards! My dad is in the bathroom rubbing sh*t on his face and my mom is in the kitchen f*cking the turkey.\"", 
    "identifier": "joke_17097Holiday Jokes", 
    "dislikes": 299, 
    "likes": 2202
},
{
    "category": "Holiday Jokes", 
    "text": "A little kids sends a letter to Santa that says: \"Dear Santa I want a brother for Christmas.\" Santa writes back, \"Dear Timmy send me me your mommy.\"", 
    "identifier": "joke_5591Holiday Jokes", 
    "dislikes": 579, 
    "likes": 1728
},
{
    "category": "Holiday Jokes", 
    "text": "Q: What is the difference between Tiger Woods and Santa Claus? A: Santa stops after three hos.", 
    "identifier": "joke_11213Holiday Jokes", 
    "dislikes": 368, 
    "likes": 967
},
{
    "category": "How to be Insulting", 
    "text": "Wife: \"I look fat. Can you give me a compliment?\" Husband: \"You have perfect eyesight.\"", 
    "identifier": "joke_7456How to be Insulting", 
    "dislikes": 3635, 
    "likes": 17463
},
{
    "category": "How to be Insulting", 
    "text": "A man goes to a bar and sees a fat girl dancing on a table. He walks over to her and says, \"Wow, nice legs!\" She is flattered and replies, \"You really think so?\" The man says, \"Oh definitely! Most tables would have collapsed by now.\"", 
    "identifier": "joke_9903How to be Insulting", 
    "dislikes": 313, 
    "likes": 2050
},
{
    "category": "How to be Insulting", 
    "text": "Yo momma is so fat she uses a pillow for a tampon.", 
    "identifier": "joke_5985How to be Insulting", 
    "dislikes": 848, 
    "likes": 1259
},
{
    "category": "How to be Insulting", 
    "text": "How to be Insulting in Theaters: If the person sitting in front of you is blocking your view, try adopting an irritating cough, or kicking your feet under their seat. Nasty, wet sneezes down the back of their neck are also effective in persuading them to look elsewhere for a seat.", 
    "identifier": "joke_1502How to be Insulting", 
    "dislikes": 528, 
    "likes": 868
},
{
    "category": "How to be Insulting", 
    "text": "How to be insulting when giving directions: Point with four fingers when they ask.", 
    "identifier": "joke_4720How to be Insulting", 
    "dislikes": 508, 
    "likes": 778
},
{
    "category": "Insult Jokes", 
    "text": "Teacher: \"Kids, what does the chicken give you?\" Student: \"Meat!\" Teacher: \"Very good! Now what does the pig give you?\" Student: \"Bacon!\" Teacher: \"Great! And what does the fat cow give you?\" Student: \"Homework!\"", 
    "identifier": "joke_12784Insult Jokes", 
    "dislikes": 10401, 
    "likes": 47655
},
{
    "category": "Insult Jokes", 
    "text": "Roses are red. Your blood is too. You look like a monkey And belong in a zoo. Do not worry, I'll be there too. Not in the cage, But laughing at you.", 
    "identifier": "joke_13743Insult Jokes", 
    "dislikes": 3886, 
    "likes": 21339
},
{
    "category": "Insult Jokes", 
    "text": "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face.", 
    "identifier": "joke_13516Insult Jokes", 
    "dislikes": 1335, 
    "likes": 8019
},
{
    "category": "Insult Jokes", 
    "text": "A teacher wanted to teach her students about self-esteem, so she asked anyone who thought they were stupid to stand up. One kid stood up and the teacher was surprised. She didn’t think anyone would stand up so she asked him, “Why did you stand up?” He answered, “I didn’t want to leave you standing up by yourself.”", 
    "identifier": "joke_2487Insult Jokes", 
    "dislikes": 883, 
    "likes": 7964
},
{
    "category": "Insult Jokes", 
    "text": "Whenever your ex says, \"You'll never find someone like me,\" the answer to that is, \"That's the point.\"", 
    "identifier": "joke_5092Insult Jokes", 
    "dislikes": 853, 
    "likes": 5400
},
{
    "category": "Miscellaneous Jokes", 
    "text": "Teacher: \"Kids, what does the chicken give you?\" Student: \"Meat!\" Teacher: \"Very good! Now what does the pig give you?\" Student: \"Bacon!\" Teacher: \"Great! And what does the fat cow give you?\" Student: \"Homework!\"", 
    "identifier": "joke_12784Miscellaneous Jokes", 
    "dislikes": 10401, 
    "likes": 47655
},
{
    "category": "Miscellaneous Jokes", 
    "text": "Why did I get divorced? Well, last week was my birthday. My wife didn't wish me a happy birthday. My parents forgot and so did my kids. I went to work and even my colleagues didn't wish me a happy birthday. As I entered my office, my secretary said, \"Happy birthday, boss!\" I felt so special. She asked me out for lunch. After lunch, she invited me to her apartment. We went there and she said, \"Do you mind if I go into the bedroom for a minute?\" \"Okay,\" I said. She came out 5 minutes later with a birthday cake, my wife, my parents, my kids, my friends, & my colleagues all yelling, \"SURPRISE!!!\" while I was waiting on the sofa... naked.", 
    "identifier": "joke_12111Miscellaneous Jokes", 
    "dislikes": 1045, 
    "likes": 9431
},
{
    "category": "Miscellaneous Jokes", 
    "text": "10 Facts About You: 1. You're reading this now. 2. You're realizing that this is a stupid fact. 4. You didn't notice I skipped number 3. 5. You're checking now. 6. You're smiling. 7. You're still reading this even though it is stupid. 9. You didn't realize I skipped number 8. 10.You're checking again and smiling because you fell for it again. 11. You're enjoying this. 12. You didn't realize I said 10 facts not 12.", 
    "identifier": "joke_16266Miscellaneous Jokes", 
    "dislikes": 699, 
    "likes": 3280
},
{
    "category": "Miscellaneous Jokes", 
    "text": "There is an overweight guy who is watching TV. A commercial comes on for a guaranteed weight loss of 10 pounds in a week. So the guy, thinking what the hell, signs up for it. Next morning an incredibly beautiful woman is standing at his door in nothing but a pair of running shoes and a sign about her neck that reads, \"If you can catch me, you can have me.\" As soon as he sees her, she takes off running. He tries to catch her, but is unable. This continues for a week, at the end of which, the man has lost 10 pounds. After this he tries the next weight loss plan, 15 pounds in a week. The next morning an even more beautiful woman is standing at the door, in similar conditions. The same happens with her as the first woman, except he almost catches her. This continues for a week, at the end of which he, as suspected, weighs 15 pounds less. Excited about this success, he decides to do the master program. Before he signs up, he is required to sign a waiver and is warned about the intensity of this plan. Still he signs up. The next morning, waiting at the door, is a hulking 300 pound muscle man with nothing but a pair of running shoes, a raging erection, and a sign around his neck that says, \"If I catch you, you're mine!\" The man was supposed to lose 25 pounds in the week; he lost 34.", 
    "identifier": "joke_12948Miscellaneous Jokes", 
    "dislikes": 462, 
    "likes": 2758
},
{
    "category": "Miscellaneous Jokes", 
    "text": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\" Johnny: \"Seven.\" Teacher: \"No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven.\" Teacher: \"Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?\" Johnny: \"Six.\" Teacher: \"Good. Now if I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven!\" Teacher: \"Johnny, where in the heck do you get seven from?!\" Johnny: \"Because I've already got a freaking cat!\"", 
    "identifier": "joke_14190Miscellaneous Jokes", 
    "dislikes": 236, 
    "likes": 2462
},
{
    "category": "National Jokes", 
    "text": "Mexico doesn't win Olympic medals because all the best runners, jumpers, and swimmers are in America.", 
    "identifier": "joke_8490National Jokes", 
    "dislikes": 844, 
    "likes": 1645
},
{
    "category": "National Jokes", 
    "text": "A German asks a Mexican if they have any Jews in Mexico. The Mexican says, “Sí, we have orange jews, apple jews, and grape jews!”", 
    "identifier": "joke_2295National Jokes", 
    "dislikes": 415, 
    "likes": 1420
},
{
    "category": "National Jokes", 
    "text": "Q: What's the difference between England and a teabag? A: A teabag could stay in the cup for longer.", 
    "identifier": "joke_12254National Jokes", 
    "dislikes": 265, 
    "likes": 892
},
{
    "category": "National Jokes", 
    "text": "China, Russia, and Poland venture to space. China says they'll go to Pluto because it's the farthest. Russia says they'll go to Jupiter because it's the biggest. Poland says they'll go to the Sun. Russia and China warn that they'll melt. They reply, \"We'll go at night.\"", 
    "identifier": "joke_4361National Jokes", 
    "dislikes": 281, 
    "likes": 815
},
{
    "category": "National Jokes", 
    "text": "Nobody starves in America. People in America die from over eating.", 
    "identifier": "joke_1637National Jokes", 
    "dislikes": 411, 
    "likes": 731
},
{
    "category": "Office Jokes", 
    "text": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"", 
    "identifier": "joke_2399Office Jokes", 
    "dislikes": 1451, 
    "likes": 5649
},
{
    "category": "Office Jokes", 
    "text": "An organization is like a tree full of monkeys, all on different limbs at different levels. The monkeys on top look down and see a tree full of smiling faces. The monkeys on the bottom look up and see nothing but assholes.", 
    "identifier": "joke_5364Office Jokes", 
    "dislikes": 343, 
    "likes": 1716
},
{
    "category": "Office Jokes", 
    "text": "A lawyer runs a stop sign and gets pulled over by a sheriff. He thinks he's smarter being a big shot lawyer from New York and has a better education than an sheriff from West Virginia. The sheriff asks for license and registration. The lawyer asks, \"What for?\" The sheriff responds, \"You didn't come to a complete stop at the stop sign.\" The lawyer says, \"I slowed down and no one was coming.\" \"You still didn't come to a complete stop. License and registration please,\" say the sheriff impatiently. The lawyer says, \"If you can show me the legal difference between slow down and stop, I'll give you my license and registration and you can give me the ticket. If not, you let me go and don't give me the ticket.\" The sheriff says, \"That sounds fair, please exit your vehicle.\" The lawyer steps out and the sheriff takes out his nightstick and starts beating the lawyer with it. The sheriff says, \"Do you want me to stop or just slow down?\"", 
    "identifier": "joke_4620Office Jokes", 
    "dislikes": 211, 
    "likes": 1539
},
{
    "category": "Office Jokes", 
    "text": "Two factory workers are talking. The woman says, \"I can make the boss give me the day off.\" The man replies, \"And how would you do that?\" The woman says, \"Just wait and see.\" She then hangs upside down from the ceiling. The boss comes in and says, \"What are you doing?\" The woman replies, \"I'm a light bulb.\" The boss then says, \"You've been working so much that you've gone crazy. I think you need to take the day off.\" The man starts to follow her and the boss says, \"Where are you going?\" The man says, \"I'm going home, too. I can't work in the dark.\"", 
    "identifier": "joke_3082Office Jokes", 
    "dislikes": 151, 
    "likes": 1280
},
{
    "category": "Office Jokes", 
    "text": "A doctor reaches into his smock to get a pen to write a prescription and pulls out a rectal thermometer. \"Oh, damn it,\" he proclaims, \"Some asshole has my pen!\"", 
    "identifier": "joke_13123Office Jokes", 
    "dislikes": 256, 
    "likes": 980
},
{
    "category": "Political Jokes", 
    "text": "Q: Why did President Obama get two terms? A: Because every black man gets a longer sentence.", 
    "identifier": "joke_7463Political Jokes", 
    "dislikes": 1091, 
    "likes": 2745
},
{
    "category": "Political Jokes", 
    "text": "If con is the opposite of pro, then is Congress the opposite of progress?", 
    "identifier": "joke_2097Political Jokes", 
    "dislikes": 337, 
    "likes": 1435
},
{
    "category": "Political Jokes", 
    "text": "Politicians and diapers have one thing in common: they should both be changed regularly… and for the same reason.", 
    "identifier": "joke_5786Political Jokes", 
    "dislikes": 223, 
    "likes": 1242
},
{
    "category": "Political Jokes", 
    "text": "Three contractors are bidding to fix a broken fence at the White House. One is from Chicago, another is from Tennessee, and the third is from Minnesota. All three go with a White House official to examine the fence. The Minnesota contractor takes out a tape measure and does some measuring, then works some figures with a pencil. \"Well,\" he says, \"I figure the job will run about $900. $400 for materials, $400 for my crew, and $100 profit for me.\" The Tennessee contractor also does some measuring and figuring, then says, \"I can do this job for $700. $300 for materials, $300 for my crew, and $100 profit for me.\" The Chicago contractor doesn't measure or figure, but leans over to the White House official and whispers, \"$2,700.\" The official, incredulous, says, \"You didn't even measure like the other guys! How did you come up with such a high figure?\" The Chicago contractor whispers back, \"$1000 for me, $1000 for you, and we hire the guy from Tennessee to fix the fence.\" \"Done!\" replies the government official. And that, my friends, is how the new stimulus plan will work.", 
    "identifier": "joke_1735Political Jokes", 
    "dislikes": 204, 
    "likes": 1079
},
{
    "category": "Political Jokes", 
    "text": "Q: Have you heard about McDonald’s new Obama Value Meal? A: Order anything you like and the guy behind you has to pay for it.", 
    "identifier": "joke_7634Political Jokes", 
    "dislikes": 375, 
    "likes": 1007
},
{
    "category": "Pop Culture Jokes", 
    "text": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!", 
    "identifier": "joke_6633Pop Culture Jokes", 
    "dislikes": 4369, 
    "likes": 16304
},
{
    "category": "Pop Culture Jokes", 
    "text": "Q: What is the Mexican version of One Direction? A: Juan Direction.", 
    "identifier": "joke_6810Pop Culture Jokes", 
    "dislikes": 755, 
    "likes": 1225
},
{
    "category": "Pop Culture Jokes", 
    "text": "So a man dies, goes to Heaven, and sees St. Peter. There are many clocks surrounding him so the man asks, \"What are these clocks for?\" St. Peter replies, \"These are lie clocks, they tick once for every lie you tell. Here we have Mother Teresa's clock. She has never lied so the clock has not moved. Honest Abe has only lied twice in his life, so it has only ticked twice.\" The man then asks, \"So where is George Bush's clock?\" St. Peter replies, \"Oh, that is in Jesus' office, he is using it as a ceiling fan!\"", 
    "identifier": "joke_5038Pop Culture Jokes", 
    "dislikes": 281, 
    "likes": 1018
},
{
    "category": "Pop Culture Jokes", 
    "text": "Q: What is the difference between Tiger Woods and Santa Claus? A: Santa stops after three hos.", 
    "identifier": "joke_11213Pop Culture Jokes", 
    "dislikes": 368, 
    "likes": 967
},
{
    "category": "Pop Culture Jokes", 
    "text": "Sherlock Holmes and Dr. Watson went on a camping trip. After a good meal and a bottle of wine, they laid down for the night, and went to sleep. Some hours later, Holmes awoke and nudged his faithful friend. \"Watson, look up at the sky and tell me what you see.\" Watson replied, \"I see millions and millions of stars.\" \"What does that tell you?\" Watson pondered for a minute. \"Astronomically, it tells me that there are millions of galaxies, and potentially billions of planets. Astrologically, I observe that Saturn is in Leo. Horologically, I deduce that the time is approximately a quarter past three. Theologically, I can see that God is all powerful and that we are small and insignificant. Meteorologically, I suspect that we will have a beautiful day tomorrow. What does it tell you?\" Holmes was silent for a minute, then spoke. \"It tells me that someone has stolen our tent.\"", 
    "identifier": "joke_2260Pop Culture Jokes", 
    "dislikes": 109, 
    "likes": 760
},
{
    "category": "Racist Jokes", 
    "text": "On the roof of a very tall building are four men; one is asian, one is mexican, one is black, and the last one is white. The asian walks to the ledge and says, \"This is for all my people\" and jumps off the roof. Next, the mexican walks to the ledge and also says, \"This is for all my people\" and then he jumps off the roof. Next is the black guy's turn. The black guy walks to the ledge and says, \"This is for all my people\" and then throws the white guy off the roof.", 
    "identifier": "joke_5396Racist Jokes", 
    "dislikes": 5422, 
    "likes": 19946
},
{
    "category": "Racist Jokes", 
    "text": "What did God say when he made the first black man? \"Damn, I burnt one.\"", 
    "identifier": "joke_6089Racist Jokes", 
    "dislikes": 9663, 
    "likes": 17902
},
{
    "category": "Racist Jokes", 
    "text": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!", 
    "identifier": "joke_6633Racist Jokes", 
    "dislikes": 4369, 
    "likes": 16304
},
{
    "category": "Racist Jokes", 
    "text": "How do you blindfold a Chinese person? Put floss over their eyes.", 
    "identifier": "joke_3160Racist Jokes", 
    "dislikes": 4725, 
    "likes": 9855
},
{
    "category": "Racist Jokes", 
    "text": "Why are asprins white? Because they work!", 
    "identifier": "joke_4736Racist Jokes", 
    "dislikes": 5678, 
    "likes": 8059
},
{
    "category": "Relationship Jokes", 
    "text": "Wife: \"How would you describe me?\" Husband: \"ABCDEFGHIJK.\" Wife: \"What does that mean?\" Husband: \"Adorable, beautiful, cute, delightful, elegant, fashionable, gorgeous, and hot.\" Wife: \"Aw, thank you, but what about IJK?\" Husband: \"I'm just kidding!\"", 
    "identifier": "joke_12142Relationship Jokes", 
    "dislikes": 5713, 
    "likes": 41778
},
{
    "category": "Relationship Jokes", 
    "text": "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\"", 
    "identifier": "joke_6693Relationship Jokes", 
    "dislikes": 5086, 
    "likes": 26109
},
{
    "category": "Relationship Jokes", 
    "text": "A lady goes to the doctor and complains that her husband is losing interest in sex. The doctor gives her a pill, but warns her that it's still experimental. He tells her to slip it into his mashed potatoes at dinner, so that night, she does just that. About a week later, she’s back at the doctor, where she says, \"Doc, the pill worked great! I put it in the potatoes like you said! It wasn't five minutes later that he jumped up, raked all the food and dishes onto the floor, grabbed me, ripped all my clothes off, and ravaged me right there on the table!\" The doctor says, \"I’m sorry, we didn’t realize the pill was that strong! The foundation will be glad to pay for any damages.\" \"Nah,\" she says, \"that's okay. We're never going back to that restaurant anyway.\"", 
    "identifier": "joke_4200Relationship Jokes", 
    "dislikes": 561, 
    "likes": 4088
},
{
    "category": "Relationship Jokes", 
    "text": "A husband exclaims to his wife one day, \"Your butt is getting really big. It's bigger than the BBQ grill!\" Later that night in bed, the husband makes some advances towards his wife who completely brushes him off. \"What's wrong?\" he asks. She answers, \"Do you really think I'm going to fire up this big-ass grill for one little weenie?\"", 
    "identifier": "joke_4576Relationship Jokes", 
    "dislikes": 670, 
    "likes": 4018
},
{
    "category": "Relationship Jokes", 
    "text": "Bob was in trouble. He forgot his wedding anniversary. His wife was really angry. She told him \"Tomorrow morning, I expect to find a gift in the driveway that goes from 0 to 200 in 6 seconds AND IT BETTER BE THERE!\" The next morning he got up early and left for work. When his wife woke up, she looked out the window and sure enough there was a box gift-wrapped in the middle of the driveway. Confused, the wife put on her robe and ran out to the driveway, brought the box back in the house. She opened it and found a brand new bathroom scale. Bob has been missing since Friday.", 
    "identifier": "joke_5414Relationship Jokes", 
    "dislikes": 495, 
    "likes": 2741
},
{
    "category": "Religious Jokes", 
    "text": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"", 
    "identifier": "joke_3272Religious Jokes", 
    "dislikes": 1615, 
    "likes": 6173
},
{
    "category": "Religious Jokes", 
    "text": "There was a preacher who fell in the ocean and he couldn't swim. When a boat came by, the captain yelled, \"Do you need help, sir?\" The preacher calmly said \"No, God will save me.\" A little later, another boat came by and a fisherman asked, \"Hey, do you need help?\" The preacher replied again, \"No God will save me.\" Eventually the preacher drowned & went to heaven. The preacher asked God, \"Why didn't you save me?\" God replied, \"Fool, I sent you two boats!\"", 
    "identifier": "joke_5388Religious Jokes", 
    "dislikes": 428, 
    "likes": 3220
},
{
    "category": "Religious Jokes", 
    "text": "Q: What do a Christmas tree and a priest have in common? A: Their balls are just for decoration.", 
    "identifier": "joke_6838Religious Jokes", 
    "dislikes": 2525, 
    "likes": 2818
},
{
    "category": "Religious Jokes", 
    "text": "Josey wasn't the best pupil at Sunday school. She often fell asleep and one day while she was sleeping, the teacher asked her a question. \"Who is the creator of the universe?\" Joe was sitting next to Josey and decided to poke her with a pin to wake her up. Josey jumped and yelled, \"God almighty!\" The teacher congratulated her. A little later the teacher asked her another question, \"Tell me who is our lord and savior?\" Joe poked Josey again and she yelled out, \"Jesus Christ!\" The teacher congratulated her again. Later on the teacher asked, \"What did Eve say to Adam after their 26th child?\" Joe poked Josey again and she shouted, \"If you stick that thing in me again, I'll snap it in half and stick it up your ass!\"", 
    "identifier": "joke_10726Religious Jokes", 
    "dislikes": 351, 
    "likes": 2594
},
{
    "category": "Religious Jokes", 
    "text": "A man is talking to God. \"God, how long is a million years?\" God answers, \"To me, it's about a minute.\" \"God, how much is a million dollars?\" \"To me, it's a penny.\" \"God, may I have a penny?\" \"Wait a minute.\"", 
    "identifier": "joke_4575Religious Jokes", 
    "dislikes": 409, 
    "likes": 2145
},
{
    "category": "School Jokes", 
    "text": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"", 
    "identifier": "joke_2006School Jokes", 
    "dislikes": 4701, 
    "likes": 45521
},
{
    "category": "School Jokes", 
    "text": "A black Jewish boy runs home from school one day and asks his father, “Daddy, am I more Jewish or more black?” The dad replies, “Why do you want to know, son?” “Because a kid at school is selling a bike for $50 and I want to know if I should talk him down to $40 or just steal it!”", 
    "identifier": "joke_4093School Jokes", 
    "dislikes": 2393, 
    "likes": 7356
},
{
    "category": "School Jokes", 
    "text": "After picking her son up from school one day, the mother asks him what he did at school. The kid replies, \"I had sex with my teacher.\" She gets so mad that when they get home, she orders him to go straight to his room. When the father returns home that evening, the mother angrily tells him the news of what their son had done. As the father hears the news, a huge grin spreads across his face. He walks to his son's room and asks him what happened at school, the son tells him, \"I had sex with my teacher.\" The father tells the boy that he is so proud of him, and he is going to reward him with the bike he has been asking for. On the way to the store, the dad asks his son if he would like to ride his new bike home. His son responds, \"No thanks Dad, my butt still hurts.\"", 
    "identifier": "joke_3024School Jokes", 
    "dislikes": 3549, 
    "likes": 7088
},
{
    "category": "School Jokes", 
    "text": "Sarah goes to school, and the teacher says, \"Today we are going to learn multi-syllable words, class. Does anybody have an example of a multi-syllable word?\" Sarah waves her hand, \"Me, Miss Rogers, me, me!\" Miss Rogers says, \"All right, Sarah, what is your multi-syllable word?\" Sarah says, \"Mas-tur-bate.\" Miss Rogers smiles and says, \"Wow, Sarah, that's a mouthful.\" Sarah says, \"No, Miss Rogers, you're thinking of a blowjob.\"", 
    "identifier": "joke_3565School Jokes", 
    "dislikes": 1242, 
    "likes": 5455
},
{
    "category": "School Jokes", 
    "text": "Little Sally came home from school with a smile on her face, and told her mother, \"Frankie Brown showed me his weenie today at the playground!\" Before the mother could raise a concern, Sally went on to say, \"It reminded me of a peanut.\" Relaxing with a hidden smile, Sally's mom asked, \"Really small, was it?\" Sally replied, \"No, salty.\" Mom fainted.", 
    "identifier": "joke_2859School Jokes", 
    "dislikes": 757, 
    "likes": 4070
},
{
    "category": "Science Jokes", 
    "text": "A science teacher tells his class, \"Oxygen is a must for breathing and life. It was discovered in 1773.\" A blonde student responds, \"Thank God I was born after 1773! Otherwise I would have died without it.\"", 
    "identifier": "joke_4597Science Jokes", 
    "dislikes": 487, 
    "likes": 2205
},
{
    "category": "Science Jokes", 
    "text": "Q: How do astronomers organize a party? A: They planet.", 
    "identifier": "joke_13231Science Jokes", 
    "dislikes": 462, 
    "likes": 1502
},
{
    "category": "Science Jokes", 
    "text": "Scientists have proven that there are two things in the air that have been known to cause women to get pregnant: their legs.", 
    "identifier": "joke_13608Science Jokes", 
    "dislikes": 544, 
    "likes": 1033
},
{
    "category": "Science Jokes", 
    "text": "Q: Why shouldn't you make fun of a paleontologist? A: Because you will get Jurasskicked.", 
    "identifier": "joke_16290Science Jokes", 
    "dislikes": 519, 
    "likes": 772
},
{
    "category": "Science Jokes", 
    "text": "Want to hear a Potassium joke? K.", 
    "identifier": "joke_16518Science Jokes", 
    "dislikes": 656, 
    "likes": 723
},
{
    "category": "Sex Jokes", 
    "text": "A mother is in the kitchen making dinner for her family when her daughter walks in. “Mother, where do babies come from?” The mother thinks for a few seconds and says, “Well dear, Mommy and Daddy fall in love and get married. One night they go into their bedroom, they kiss and hug, and have sex.” The daughter looks puzzled so the mother continues, “That means the daddy puts his penis in the mommy’s vagina. That’s how you get a baby, honey.” The child seems to comprehend. “Oh, I see, but the other night when I came into your room you had daddy’s penis in your mouth. What do you get when you do that?” “Jewelry, my dear. Jewelry.”", 
    "identifier": "joke_4350Sex Jokes", 
    "dislikes": 8633, 
    "likes": 54759
},
{
    "category": "Sex Jokes", 
    "text": "A family is at the dinner table. The son asks the father, “Dad, how many kinds of boobs are there?” The father, surprised, answers, “Well, son, a woman goes through three phases. In her 20s, a woman’s breasts are like melons, round and firm. In her 30s and 40s, they are like pears, still nice, hanging a bit. After 50, they are like onions.” “Onions?” the son asks. “Yes. You see them and they make you cry.” This infuriated his wife and daughter. The daughter asks, “Mom, how many different kinds of willies are there?” The mother smiles and says, “Well, dear, a man goes through three phases also. In his 20s, his willy is like an oak tree, mighty and hard. In his 30s and 40s, it’s like a birch, flexible but reliable. After his 50s, it’s like a Christmas tree.” “A Christmas tree?” the daughter asks. “Yes, dead from the root up and the balls are just for decoration.”", 
    "identifier": "joke_3413Sex Jokes", 
    "dislikes": 5714, 
    "likes": 52971
},
{
    "category": "Sex Jokes", 
    "text": "A teacher is teaching a class and she sees that Johnny isn't paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you're thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you're thinking!\"", 
    "identifier": "joke_2006Sex Jokes", 
    "dislikes": 4701, 
    "likes": 45521
},
{
    "category": "Sex Jokes", 
    "text": "Why did I get divorced? Well, last week was my birthday. My wife didn't wish me a happy birthday. My parents forgot and so did my kids. I went to work and even my colleagues didn't wish me a happy birthday. As I entered my office, my secretary said, \"Happy birthday, boss!\" I felt so special. She asked me out for lunch. After lunch, she invited me to her apartment. We went there and she said, \"Do you mind if I go into the bedroom for a minute?\" \"Okay,\" I said. She came out 5 minutes later with a birthday cake, my wife, my parents, my kids, my friends, & my colleagues all yelling, \"SURPRISE!!!\" while I was waiting on the sofa... naked.", 
    "identifier": "joke_12111Sex Jokes", 
    "dislikes": 1045, 
    "likes": 9431
},
{
    "category": "Sex Jokes", 
    "text": "A little girl and boy are fighting about the differences between the sexes, and which one is better. Finally, the boy drops his pants and says, “Here’s something I have that you’ll never have!” The little girl is pretty upset by this, since it is clearly true, and runs home crying. A while later, she comes running back with a smile on her face. She drops her pants and says, “My mommy says that with one of these, I can have as many of those as I want!”", 
    "identifier": "joke_3766Sex Jokes", 
    "dislikes": 1295, 
    "likes": 9291
},
{
    "category": "Sexist Jokes", 
    "text": "Q: What did one saggy boob say to the other saggy boob? A: \"We better get some support before someone thinks we're nuts!\"", 
    "identifier": "joke_5296Sexist Jokes", 
    "dislikes": 3814, 
    "likes": 18306
},
{
    "category": "Sexist Jokes", 
    "text": "Wife: \"I look fat. Can you give me a compliment?\" Husband: \"You have perfect eyesight.\"", 
    "identifier": "joke_7456Sexist Jokes", 
    "dislikes": 3635, 
    "likes": 17463
},
{
    "category": "Sexist Jokes", 
    "text": "As an airplane is about to crash, a female passenger jumps up frantically and announces, \"If I'm going to die, I want to die feeling like a woman.\" She removes all her clothing and asks, \"Is there someone on this plane who is man enough to make me feel like a woman?\" A man stands up, removes his shirt and says, \"Here, iron this!\".", 
    "identifier": "joke_5029Sexist Jokes", 
    "dislikes": 2299, 
    "likes": 10482
},
{
    "category": "Sexist Jokes", 
    "text": "Why do women make better soldiers? Because they can bleed for a week and not die.", 
    "identifier": "joke_4399Sexist Jokes", 
    "dislikes": 2319, 
    "likes": 7781
},
{
    "category": "Sexist Jokes", 
    "text": "A young woman was taking golf lessons and had just started playing her first round of golf when she suffered a bee sting. Her pain was so intense that she decided to return to the clubhouse for medical assistance. The golf pro saw her heading back and said, “You are back early, what’s wrong?” “I was stung by a bee!” she said. “Where?” he asked. “Between the first and second hole.” she replied. He nodded and said, “Your stance is far too wide.”", 
    "identifier": "joke_4086Sexist Jokes", 
    "dislikes": 1602, 
    "likes": 6200
},
{
    "category": "Sports Jokes", 
    "text": "There is an overweight guy who is watching TV. A commercial comes on for a guaranteed weight loss of 10 pounds in a week. So the guy, thinking what the hell, signs up for it. Next morning an incredibly beautiful woman is standing at his door in nothing but a pair of running shoes and a sign about her neck that reads, \"If you can catch me, you can have me.\" As soon as he sees her, she takes off running. He tries to catch her, but is unable. This continues for a week, at the end of which, the man has lost 10 pounds. After this he tries the next weight loss plan, 15 pounds in a week. The next morning an even more beautiful woman is standing at the door, in similar conditions. The same happens with her as the first woman, except he almost catches her. This continues for a week, at the end of which he, as suspected, weighs 15 pounds less. Excited about this success, he decides to do the master program. Before he signs up, he is required to sign a waiver and is warned about the intensity of this plan. Still he signs up. The next morning, waiting at the door, is a hulking 300 pound muscle man with nothing but a pair of running shoes, a raging erection, and a sign around his neck that says, \"If I catch you, you're mine!\" The man was supposed to lose 25 pounds in the week; he lost 34.", 
    "identifier": "joke_12948Sports Jokes", 
    "dislikes": 462, 
    "likes": 2758
},
{
    "category": "Sports Jokes", 
    "text": "Three guys go to a ski lodge, and there aren't enough rooms, so they have to share a bed. In the middle of the night, the guy on the right wakes up and says, \"I had this wild, vivid dream of getting a hand job!\" The guy on the left wakes up, and unbelievably, he's had the same dream, too. Then the guy in the middle wakes up and says, \"That's funny, I dreamed I was skiing!\"", 
    "identifier": "joke_6835Sports Jokes", 
    "dislikes": 791, 
    "likes": 2452
},
{
    "category": "Sports Jokes", 
    "text": "Yo mom is so dumb that she thought Dunkin' Donuts was a basketball team.", 
    "identifier": "joke_10078Sports Jokes", 
    "dislikes": 341, 
    "likes": 1753
},
{
    "category": "Sports Jokes", 
    "text": "A man joins a soccer team and his new teammates inform him, \"At your first team dinner as the new guy, you will have to give us a talk about sex.\" The evening arrives and he gives a detailed, humorous account of his sex life. When he got home, his wife asked how the evening went and not wanting to lie, but also not wanting to explain exactly what happened, he said, \"Oh, I had to make a talk about yachting,\" his wife thought this a little peculiar but said nothing more and went to sleep. The next day she bumped into one of his new teammates at the supermarket and asked, \"I heard my husband had to make a speech last night. How did it go?\" His mate said smiling, 'Oh, it was excellent! Your husband is clearly very experienced!.\" The wife looked confused and replied to his mate, \"Strange, he has only done it twice and the second time he was sick.\"", 
    "identifier": "joke_12499Sports Jokes", 
    "dislikes": 244, 
    "likes": 1116
},
{
    "category": "Sports Jokes", 
    "text": "It's game 7 of the NBA finals and a man makes his way to his seat at center court. He sits down and notices that the seat next to him is empty. He leans over and asks his neighbor if someone is sitting there. He responds, \"No, the seat's empty.\" \"The first man exclaims, \"What?!? Who in their right mind would have a seat like this for the NBA finals and not use it?\" The neighbor responds, \"Well the seat is mine, but my wife passed away and this is the first NBA finals we haven't been together.\" The first man responds,\" I'm sorry to hear that. Wasn't there anyone else, a friend or relative, that could've taken that seat?\" The neighbor responds, \"No, they're all at the funeral.\"", 
    "identifier": "joke_4845Sports Jokes", 
    "dislikes": 338, 
    "likes": 977
},
{
    "category": "Technology Jokes", 
    "text": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!", 
    "identifier": "joke_6633Technology Jokes", 
    "dislikes": 4369, 
    "likes": 16304
},
{
    "category": "Technology Jokes", 
    "text": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"", 
    "identifier": "joke_2399Technology Jokes", 
    "dislikes": 1451, 
    "likes": 5649
},
{
    "category": "Technology Jokes", 
    "text": "Yo momma is so fat, when she sat on an iPod, she made the iPad!", 
    "identifier": "joke_6063Technology Jokes", 
    "dislikes": 1682, 
    "likes": 4736
},
{
    "category": "Technology Jokes", 
    "text": "Q: Why couldn't the blonde add 10 + 5 on a calculator? A: She couldn't find the \"10\" button.", 
    "identifier": "joke_6446Technology Jokes", 
    "dislikes": 1177, 
    "likes": 2412
},
{
    "category": "Technology Jokes", 
    "text": "I named my hard drive \"dat ass,\" so once a month my computer asks if I want to \"back dat ass up.\"", 
    "identifier": "joke_6831Technology Jokes", 
    "dislikes": 255, 
    "likes": 979
},
{
    "category": "Word Play Jokes", 
    "text": "What happens to a frog's car when it breaks down? It gets toad away.", 
    "identifier": "joke_6982Word Play Jokes", 
    "dislikes": 4160, 
    "likes": 12040
},
{
    "category": "Word Play Jokes", 
    "text": "A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"", 
    "identifier": "joke_3272Word Play Jokes", 
    "dislikes": 1615, 
    "likes": 6173
},
{
    "category": "Word Play Jokes", 
    "text": "Q: Why was six scared of seven? A: Because seven \"ate\" nine.", 
    "identifier": "joke_6180Word Play Jokes", 
    "dislikes": 1770, 
    "likes": 3426
},
{
    "category": "Word Play Jokes", 
    "text": "Q: What is the difference between snowmen and snowwomen? A: Snowballs.", 
    "identifier": "joke_5977Word Play Jokes", 
    "dislikes": 755, 
    "likes": 2986
},
{
    "category": "Word Play Jokes", 
    "text": "I never wanted to believe that my Dad was stealing from his job as a road worker. But when I got home, all the signs were there.", 
    "identifier": "joke_6017Word Play Jokes", 
    "dislikes": 709, 
    "likes": 2613
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma is so fat, I took a picture of her last Christmas and it's still printing.", 
    "identifier": "joke_6051Yo Momma Jokes", 
    "dislikes": 9290, 
    "likes": 40513
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma is so fat when she got on the scale it said, \"I need your weight not your phone number.\"", 
    "identifier": "joke_6052Yo Momma Jokes", 
    "dislikes": 8557, 
    "likes": 33965
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma is so fat that when she went to the beach a whale swam up and sang, \"We are family, even though you're fatter than me.\"", 
    "identifier": "joke_6054Yo Momma Jokes", 
    "dislikes": 8612, 
    "likes": 25115
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo mamma is so ugly when she tried to join an ugly contest they said, \"Sorry, no professionals.\"", 
    "identifier": "joke_6034Yo Momma Jokes", 
    "dislikes": 7006, 
    "likes": 24359
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma's so fat and old when God said, \"Let there be light,\" he asked your mother to move out of the way.", 
    "identifier": "joke_5989Yo Momma Jokes", 
    "dislikes": 7613, 
    "likes": 21559
},
{
    "category": "Popular Jokes", 
    "text": "A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\"", 
    "identifier": "joke_5300Popular Jokes", 
    "dislikes": 1354, 
    "likes": 5050
},
{
    "category": "Popular Jokes", 
    "text": "What did God say when he made the first black man? \"Damn, I burnt one.\"", 
    "identifier": "joke_6089Popular Jokes", 
    "dislikes": 9663, 
    "likes": 17902
},
{
    "category": "Popular Jokes", 
    "text": "Do not be racist; be like Mario. He's an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew!", 
    "identifier": "joke_6633Popular Jokes", 
    "dislikes": 4369, 
    "likes": 16304
},
{
    "category": "Popular Jokes", 
    "text": "On the roof of a very tall building are four men; one is asian, one is mexican, one is black, and the last one is white. The asian walks to the ledge and says, \"This is for all my people\" and jumps off the roof. Next, the mexican walks to the ledge and also says, \"This is for all my people\" and then he jumps off the roof. Next is the black guy's turn. The black guy walks to the ledge and says, \"This is for all my people\" and then throws the white guy off the roof.", 
    "identifier": "joke_5396Popular Jokes", 
    "dislikes": 5422, 
    "likes": 19946
},
{
    "category": "Popular Jokes", 
    "text": "Teacher: \"Kids, what does the chicken give you?\" Student: \"Meat!\" Teacher: \"Very good! Now what does the pig give you?\" Student: \"Bacon!\" Teacher: \"Great! And what does the fat cow give you?\" Student: \"Homework!\"", 
    "identifier": "joke_12784Popular Jokes", 
    "dislikes": 10401, 
    "likes": 47655
},
{
    "category": "Animal Jokes", 
    "text": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount. If I can, I will send you a telegram.\" She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"", 
    "identifier": "joke_17102Animal Jokes", 
    "dislikes": 262, 
    "likes": 1823
},
{
    "category": "Animal Jokes", 
    "text": "Two bats are hanging upside down on a branch. One asks the other, \"Do you recall your worst day last year?\" The other responds, \"Yes, the day I had diarrhea!\"", 
    "identifier": "joke_5077Animal Jokes", 
    "dislikes": 1024, 
    "likes": 1684
},
{
    "category": "Animal Jokes", 
    "text": "Q: How do you count cows? A: With a cowculator.", 
    "identifier": "joke_16486Animal Jokes", 
    "dislikes": 674, 
    "likes": 1564
},
{
    "category": "Animal Jokes", 
    "text": "Q: Can a kangaroo jump higher than the Empire State Building? A: Of course. The Empire State Building can't jump.", 
    "identifier": "joke_14319Animal Jokes", 
    "dislikes": 292, 
    "likes": 1284
},
{
    "category": "Animal Jokes", 
    "text": "You are on a horse, galloping at a constant speed. On your right side is a sharp drop off, and on your left side is an elephant traveling at the same speed as you. Directly in front of you is another galloping horse but your horse is unable to overtake it. Behind you is a lion running at the same speed as you and the horse in front of you. What must you do to safely get out of this highly dangerous situation? Get your drunk ass off the merry-go-round!", 
    "identifier": "joke_7495Animal Jokes", 
    "dislikes": 241, 
    "likes": 1219
},
{
    "category": "Blonde Jokes", 
    "text": "A guy took his blonde girlfriend to her first football game. They had great seats right behind their team's bench. After the game, he asked her how she liked the experience. \"Oh, I really liked it,\" she replied, \"especially the tight pants and all the big muscles, but I just couldn't understand why they were killing each other over 25 cents.\" Dumbfounded, her date asked, \"What do you mean?\" \"Well, they flipped a coin, one team got it, and then for the rest of the game, all they kept screaming was, 'Get the quarterback! Get the quarterback!' I'm like, hello? It's only 25 cents!\"", 
    "identifier": "joke_2083Blonde Jokes", 
    "dislikes": 541, 
    "likes": 5551
},
{
    "category": "Blonde Jokes", 
    "text": "A robber comes into the store & steals a TV. A blonde runs after him and says, \"Wait, you forgot the remote!\"", 
    "identifier": "joke_4867Blonde Jokes", 
    "dislikes": 493, 
    "likes": 4284
},
{
    "category": "Blonde Jokes", 
    "text": "There was a blonde who just got sick and tired of all the blonde jokes. One evening, she went home and memorized all the state capitals. Back in the office the next day, some guy started telling a dumb blonde joke. She interrupted him with a shrill announcement, \"I've had it up to here with these blonde jokes. I want you to know that this blonde went home last night and did something probably none of you could do. I memorized all the state capitals.\" One of the guys, of course, said, \"I don't believe you. What is the capital of Nevada?\" \"N,\" she answered.", 
    "identifier": "joke_4184Blonde Jokes", 
    "dislikes": 699, 
    "likes": 4069
},
{
    "category": "Blonde Jokes", 
    "text": "A blonde, wanting to earn some money, decided to hire herself out as a handyman-type and started canvassing a wealthy neighborhood. She went to the front door of the first house and asked the owner if he had any jobs for her to do. \"Well, you can paint my porch. How much will you charge?\" The blonde said, \"How about 50 dollars?\" The man agreed and told her that the paint and ladders that she might need were in the garage. The man's wife, inside the house, heard the conversation and said to her husband, \"Does she realize that the porch goes all the way around the house?\" The man replied, \"She should. She was standing on the porch.\" A short time later, the blonde came to the door to collect her money. \"You're finished already?\" he asked. \"Yes,\" the blonde answered, \"and I had paint left over, so I gave it two coats. \"Impressed, the man reached in his pocket for the $50. \"And by the way,\" the blonde added, \"that's not a Porch, it's a Ferrari.\"", 
    "identifier": "joke_5631Blonde Jokes", 
    "dislikes": 418, 
    "likes": 3374
},
{
    "category": "Blonde Jokes", 
    "text": "A guy was driving in a car with a blonde. He told her to stick her head out the window and see if the blinker worked. She stuck her head out and said, \"Yes, No, Yes, No, Yes...\"", 
    "identifier": "joke_3224Blonde Jokes", 
    "dislikes": 515, 
    "likes": 3147
},
{
    "category": "Boycott These Jokes", 
    "text": "Don't be racist; racism is a crime; and crime is for black people.", 
    "identifier": "joke_12019Boycott These Jokes", 
    "dislikes": 440, 
    "likes": 1028
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: What's the difference between a black and an Asian? A: 10 minutes in the oven.", 
    "identifier": "joke_6465Boycott These Jokes", 
    "dislikes": 899, 
    "likes": 959
},
{
    "category": "Boycott These Jokes", 
    "text": "An old man takes his grandson fishing in a local pond one day. After 20 minutes of fishing, the old man fires up a cigar. The young boy asks, \"Grandpa, can I have a cigar?\" The old man asks, \"Son, can your d*ck touch your asshole?\" The young boy says no. \"Then u can't have a cigar.\" Another 20 minutes passes, and the old man opens a beer. The young boy asks, \"Grandpa, can I have a beer?\" The old man asks, \"Son, can your d*ck touch your asshole?\" The young boy says no. \"Well, then u can't have a beer.\" Another 20 minutes passes, and the young boy opens a bag of potato chips. The old man asks, \"Son, can I have some of your chips?\" The boy asks, \"Well, Grandpa, can your d*ck touch your asshole?\" The old man says, \"It sure can.\" The boy says, \"Well good, then go f*ck yourself, these are my chips.\"", 
    "identifier": "joke_2274Boycott These Jokes", 
    "dislikes": 87, 
    "likes": 738
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: What's the difference between Usain Bolt and Hitler? A: Usain Bolt can finish a race.", 
    "identifier": "joke_19977Boycott These Jokes", 
    "dislikes": 575, 
    "likes": 699
},
{
    "category": "Boycott These Jokes", 
    "text": "Q: How does a black girl tell if she is pregnant? A: When she pulls the tampon out all the cotton is picked.", 
    "identifier": "joke_10062Boycott These Jokes", 
    "dislikes": 413, 
    "likes": 638
},
{
    "category": "Clean Jokes", 
    "text": "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\"", 
    "identifier": "joke_2399Clean Jokes", 
    "dislikes": 1451, 
    "likes": 5649
},
{
    "category": "Clean Jokes", 
    "text": "Q: Why was six scared of seven? A: Because seven \"ate\" nine.", 
    "identifier": "joke_6180Clean Jokes", 
    "dislikes": 1770, 
    "likes": 3426
},
{
    "category": "Clean Jokes", 
    "text": "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business & the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\"", 
    "identifier": "joke_11231Clean Jokes", 
    "dislikes": 319, 
    "likes": 2480
},
{
    "category": "Clean Jokes", 
    "text": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\" Johnny: \"Seven.\" Teacher: \"No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven.\" Teacher: \"Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?\" Johnny: \"Six.\" Teacher: \"Good. Now if I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven!\" Teacher: \"Johnny, where in the heck do you get seven from?!\" Johnny: \"Because I've already got a freaking cat!\"", 
    "identifier": "joke_14190Clean Jokes", 
    "dislikes": 236, 
    "likes": 2462
},
{
    "category": "Clean Jokes", 
    "text": "Q: Why couldn't the blonde add 10 + 5 on a calculator? A: She couldn't find the \"10\" button.", 
    "identifier": "joke_6446Clean Jokes", 
    "dislikes": 1177, 
    "likes": 2412
},
{
    "category": "Family Jokes", 
    "text": "Wife: \"In my dream, I saw you in a jewelry store and you bought me a diamond ring.\" Husband: \"I had the same dream and I saw your dad paying the bill.\"", 
    "identifier": "joke_16324Family Jokes", 
    "dislikes": 337, 
    "likes": 1444
},
{
    "category": "Family Jokes", 
    "text": "One day Jimmy got home early from school and his mom asked, \"Why are you home so early?\" He answered, \"Because I was the only one that answered a question in my class.\" She said, \"Wow, my son is a genius. What was the question?\" Jimmy replied, \"The question was 'Who threw the trash can at the principal's head?'\"", 
    "identifier": "joke_14469Family Jokes", 
    "dislikes": 129, 
    "likes": 1114
},
{
    "category": "Family Jokes", 
    "text": "There was an elderly couple who in their old age noticed that they were getting a lot more forgetful, so they decided to go to the doctor. The doctor told them that they should start writing things down so they don't forget. They went home and the old lady told her husband to get her a bowl of ice cream. \"You might want to write it down,\" she said. The husband said, \"No, I can remember that you want a bowl of ice cream.\" She then told her husband she wanted a bowl of ice cream with whipped cream. \"Write it down,\" she told him, and again he said, \"No, no, I can remember: you want a bowl of ice cream with whipped cream.\" Then the old lady said she wants a bowl of ice cream with whipped cream and a cherry on top. \"Write it down,\" she told her husband and again he said, \"No, I got it. You want a bowl of ice cream with whipped cream and a cherry on top.\" So he goes to get the ice cream and spends an unusually long time in the kitchen, over 30 minutes. He comes out to his wife and hands her a plate of eggs and bacon. The old wife stares at the plate for a moment, then looks at her husband and asks, \"Where's the toast?\"", 
    "identifier": "joke_13472Family Jokes", 
    "dislikes": 222, 
    "likes": 1055
},
{
    "category": "Family Jokes", 
    "text": "A 3 years old boy sits near a pregnant woman. Boy: Why do you look so fat? Pregnant woman: I have a baby inside me. Boy: Is it a good baby? Pregnant woman: Yes, it is a very good baby. Boy: Then why did you eat it?!", 
    "identifier": "joke_16580Family Jokes", 
    "dislikes": 142, 
    "likes": 995
},
{
    "category": "Family Jokes", 
    "text": "Q: Why did the witches' team lose the baseball game? A: Their bats flew away.", 
    "identifier": "joke_5889Family Jokes", 
    "dislikes": 374, 
    "likes": 922
},
{
    "category": "Food Jokes", 
    "text": "Q: Why do Mexicans eat beans for dinner? A: So they can take bubble baths.", 
    "identifier": "joke_6059Food Jokes", 
    "dislikes": 2795, 
    "likes": 5162
},
{
    "category": "Food Jokes", 
    "text": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"", 
    "identifier": "joke_13188Food Jokes", 
    "dislikes": 721, 
    "likes": 2127
},
{
    "category": "Food Jokes", 
    "text": "A boy asks his father, \"Dad, are bugs good to eat?\" \"That's disgusting. Don't talk about things like that over dinner,\" the dad replies. After dinner the father asks, \"Now, son, what did you want to ask me?\" \"Oh, nothing,\" the boy says. \"There was a bug in your soup, but now it’s gone.\"", 
    "identifier": "joke_17896Food Jokes", 
    "dislikes": 106, 
    "likes": 917
},
{
    "category": "Food Jokes", 
    "text": "Your Halloween costume came in the mail today. I opened it. It was a rooster mask and a bag of lollipops. Going as a c*ck sucker again!?", 
    "identifier": "joke_1843Food Jokes", 
    "dislikes": 295, 
    "likes": 651
},
{
    "category": "Food Jokes", 
    "text": "Scientists have discovered a food that diminishes a woman's sex drive by 90%. It's called a wedding cake.", 
    "identifier": "joke_316Food Jokes", 
    "dislikes": 169, 
    "likes": 572
},
{
    "category": "Holiday Jokes", 
    "text": "Q: Why did the witches' team lose the baseball game? A: Their bats flew away.", 
    "identifier": "joke_5889Holiday Jokes", 
    "dislikes": 374, 
    "likes": 922
},
{
    "category": "Holiday Jokes", 
    "text": "A woman had never seen Santa Claus before, but on Christmas Eve night she heard someone come down her chimney so she went downstairs to check it out. ''Oh, it's Santa Claus,\" she said, \"Please stay and chat this is the first time I have met you.\" Santa replied, \"Ho ho ho, I need to go. I need to go!\" The lady took off her robe, but Santa said, \"Ho ho ho, I need to go. I need to go!\" The lady slipped off her nightgown and Santa told her, \"Ho ho ho, I need to go. I need to go!\" Then the lady removed her panties, and Santa said, ''Hey hey hey, I need to stay. I need to stay, 'cause I can't go up the chimney with my dick this way!\"", 
    "identifier": "joke_14448Holiday Jokes", 
    "dislikes": 210, 
    "likes": 600
},
{
    "category": "Holiday Jokes", 
    "text": "Q: Why is Santa Claus' sack so big? A: He only comes once a year.", 
    "identifier": "joke_8775Holiday Jokes", 
    "dislikes": 288, 
    "likes": 587
},
{
    "category": "Holiday Jokes", 
    "text": "Why is Santa Claus so jolly? Because he knows where all the naughty girls live.", 
    "identifier": "joke_10743Holiday Jokes", 
    "dislikes": 154, 
    "likes": 464
},
{
    "category": "Holiday Jokes", 
    "text": "Yo momma is so stupid when I told her Christmas is right around the corner she went looking for it.", 
    "identifier": "joke_14769Holiday Jokes", 
    "dislikes": 200, 
    "likes": 363
},
{
    "category": "How to be Insulting", 
    "text": "A kid from Mississippi is on Harvard campus for the first time, he stops a student and asks, \"Excuse me, can you tell me where the library is at?\" The Harvard student replies \"At Harvard, you don’t end a sentence with a preposition.\" The kid said, \"Sorry about that. Can you tell me where the library is at, asshole?\"", 
    "identifier": "joke_10596How to be Insulting", 
    "dislikes": 68, 
    "likes": 587
},
{
    "category": "How to be Insulting", 
    "text": "Interviewer: \"What's your greatest weakness?\" Candidate: \"Honesty.\" Interviewer: \"I don't think honesty is a weakness.\" Candidate: \"I don't give a f*ck what you think.\"", 
    "identifier": "joke_9902How to be Insulting", 
    "dislikes": 105, 
    "likes": 579
},
{
    "category": "How to be Insulting", 
    "text": "If you ever fart in public, just yell, \"Turbo power!\" and walk faster.", 
    "identifier": "joke_12928How to be Insulting", 
    "dislikes": 85, 
    "likes": 510
},
{
    "category": "How to be Insulting", 
    "text": "How to be Insulting at Christmas: Try to find what you were given last year and give it back to the person who gave it to you.", 
    "identifier": "joke_1522How to be Insulting", 
    "dislikes": 75, 
    "likes": 350
},
{
    "category": "How to be Insulting", 
    "text": "How to be Insulting on Public Transportation: Pretend to be foreign when the conductor asks for your fare and try to give him the wrong denomination of money.", 
    "identifier": "joke_1480How to be Insulting", 
    "dislikes": 134, 
    "likes": 238
},
{
    "category": "Insult Jokes", 
    "text": "Light travels faster than sound. This is why some people appear bright until you hear them speak.", 
    "identifier": "joke_5633Insult Jokes", 
    "dislikes": 695, 
    "likes": 3312
},
{
    "category": "Insult Jokes", 
    "text": "Bob was in trouble. He forgot his wedding anniversary. His wife was really angry. She told him \"Tomorrow morning, I expect to find a gift in the driveway that goes from 0 to 200 in 6 seconds AND IT BETTER BE THERE!\" The next morning he got up early and left for work. When his wife woke up, she looked out the window and sure enough there was a box gift-wrapped in the middle of the driveway. Confused, the wife put on her robe and ran out to the driveway, brought the box back in the house. She opened it and found a brand new bathroom scale. Bob has been missing since Friday.", 
    "identifier": "joke_5414Insult Jokes", 
    "dislikes": 495, 
    "likes": 2741
},
{
    "category": "Insult Jokes", 
    "text": "Q: Which sexual position produces the ugliest children? A: Ask your mother.", 
    "identifier": "joke_6840Insult Jokes", 
    "dislikes": 918, 
    "likes": 2421
},
{
    "category": "Insult Jokes", 
    "text": "Did you hear about the two bald guys who put their heads together? They made an ass out of themselves!", 
    "identifier": "joke_3292Insult Jokes", 
    "dislikes": 594, 
    "likes": 1811
},
{
    "category": "Insult Jokes", 
    "text": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"", 
    "identifier": "joke_13483Insult Jokes", 
    "dislikes": 343, 
    "likes": 1746
},
{
    "category": "Miscellaneous Jokes", 
    "text": "A recent worldwide survey showed that out of 2,146,703,436 people, 94% were too lazy to actually read that number.", 
    "identifier": "joke_19929Miscellaneous Jokes", 
    "dislikes": 265, 
    "likes": 1834
},
{
    "category": "Miscellaneous Jokes", 
    "text": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"", 
    "identifier": "joke_13483Miscellaneous Jokes", 
    "dislikes": 343, 
    "likes": 1746
},
{
    "category": "Miscellaneous Jokes", 
    "text": "A few days after Christmas, a mother was working in the kitchen listening to her young son playing with his new electric train in the living room. She heard the train stop and her son said, \"All of you sons of bitches who want off, get the hell off now, cause this is the last stop! And all of you sons of bitches who are getting on, get your asses in the train, cause we're going down the tracks.\" The mother went nuts and told her son, \"We don't use that kind of language in this house. Now I want you to go to your room and you are to stay there for TWO HOURS. When you come out, you may play with your train, but I want you to use nice language.\" Two hours later, the son comes out of the bedroom and resumes playing with his train. Soon the train stopped and the mother heard her son say, \"All passengers who are disembarking from the train, please remember to take all of your belongings with you. We thank you for riding with us today and hope your trip was a pleasant one. We hope you will ride with us again soon.\" She hears the little boy continue, \"For those of you just boarding, we ask you to stow all of your hand luggage under your seat. Remember, there is no smoking on the train. We hope you will have a pleasant and relaxing journey with us today.\" As the mother began to smile, the child added, \"For those of you who are pissed off about the two hour delay, please see the bitch in the kitchen.\"", 
    "identifier": "joke_4970Miscellaneous Jokes", 
    "dislikes": 195, 
    "likes": 1680
},
{
    "category": "Miscellaneous Jokes", 
    "text": "A man buys a lie detector robot that slaps people who lie. He decides to test it at dinner. He asks his son, \"Son, where were you today during school hours?\" \"At school.\" The robot slaps the son. \"Okay, I went to the movies!\" The father asks, \"Which one?\" \"Harry Potter.\" The robot slaps the son again. \"Okay, I was watching porn!\" The father replies, \"What? When I was your age I didn't even know what porn was!\" The robot slaps the father. The mom chimes in, \"Haha! After all, he is your son!\" The robot slaps the mother.", 
    "identifier": "joke_4483Miscellaneous Jokes", 
    "dislikes": 141, 
    "likes": 1398
},
{
    "category": "Miscellaneous Jokes", 
    "text": "A woman goes to her boyfriend's parents' house for dinner. This is her first time meeting the family and she is very nervous. They all sit down and begin eating a fine meal. The woman is beginning to feel a little discomfort, thanks to her nervousness and the broccoli casserole. The gas pains are almost making her eyes water. Left with no other choice, she decides to relieve herself a bit and lets out a dainty little fart. It wasn't loud, but everyone at the table heard the poot. Before she even had a chance to be embarrassed, her boyfriend's father looked over at the dog that had been snoozing at the women's feet, and said in a rather stern voice, \"Ginger!\" The woman thought, \"This is great!\" and a big smile came across her face. A couple minutes later, she was beginning to feel the pain again. This time, she didn't hesitate. She let a much louder and longer fart rip. The father again looked at the dog and yelled, \"Dammit, Ginger!\" Once again the woman smiled and thought, \"Yes!\" A few minutes later the woman had to let another one rip. This time she didn't even think about it. She let rip a fart that rivaled a train whistle blowing. Again, the father looked at the dog with disgust and yelled, \"Dammit, Ginger, get away from her before she shits on you!\"", 
    "identifier": "joke_10454Miscellaneous Jokes", 
    "dislikes": 159, 
    "likes": 1328
},
{
    "category": "National Jokes", 
    "text": "In the beginning, God created the heaven and the earth... After that, everything else was made in China.", 
    "identifier": "joke_19854National Jokes", 
    "dislikes": 177, 
    "likes": 655
},
{
    "category": "National Jokes", 
    "text": "So two Irishmen are traveling to Australia. Before they leave home, one of their dads gives them both a bit of advice: \"You watch them Aussie cab drivers. They'll rob you blind. Don't you go paying them what they ask. You haggle.\" At the Sydney airport, the Irishmen catch a cab to their hotel. When they reach their destination, the cabbie says, \"That'll be twenty dollars, lads.\" \"Oh no you don't! My dad warned me about you. You'll only be getting fifteen dollars from me,\" says one of the men. \"And you'll only be getting fifteen from me too,\" adds the other.", 
    "identifier": "joke_14687National Jokes", 
    "dislikes": 184, 
    "likes": 587
},
{
    "category": "National Jokes", 
    "text": "Q: Why is England the wettest country? A: Because so many kings and queens have been reigning there.", 
    "identifier": "joke_16262National Jokes", 
    "dislikes": 436, 
    "likes": 421
},
{
    "category": "National Jokes", 
    "text": "Q: What’s the best thing about Switzerland? A: I don't know, but the flag is a big plus.", 
    "identifier": "joke_12951National Jokes", 
    "dislikes": 174, 
    "likes": 420
},
{
    "category": "National Jokes", 
    "text": "Q: What do you call two Mexicans playing basketball? A: Juan on Juan.", 
    "identifier": "joke_14262National Jokes", 
    "dislikes": 290, 
    "likes": 415
},
{
    "category": "Office Jokes", 
    "text": "A thief stuck a pistol in a man's ribs and said, \"Give me your money.\" The gentleman, shocked by the sudden attack, said, \"You cannot do this, I'm a congressman!\" The thief replied, \"In that case, give me MY money!\"", 
    "identifier": "joke_3427Office Jokes", 
    "dislikes": 94, 
    "likes": 647
},
{
    "category": "Office Jokes", 
    "text": "A boss said to his secretary, \"I want to have sex with you, but I will make it very fast. I'll throw $1,000 on the floor and by the time you bend down to pick it up, I'll be done.\" She thought for a moment then called her boyfriend and told him the story. Her boyfriend said, \"Do it but ask him for $2,000. Then pick up the money so fast, he won't even have enough time to undress himself.\" She agrees. After half an hour passes, the boyfriend calls the girlfriend and asks, \"So what happened?\" She responds, \"The bastard used coins, so I'm still picking it up and he is still having sex with me!\"", 
    "identifier": "joke_17858Office Jokes", 
    "dislikes": 94, 
    "likes": 492
},
{
    "category": "Office Jokes", 
    "text": "A lawyer is standing in a long line at the box office. Suddenly, he feels a pair of hands kneading his shoulders, back, and neck. The lawyer turns around. \"What the hell do you think you're doing?\" \"I'm a chiropractor, and I'm just keeping in practice while I'm waiting in line.\" \"Well, I'm a lawyer, but you don't see me screwing the guy in front of me, do you?\"", 
    "identifier": "joke_4673Office Jokes", 
    "dislikes": 278, 
    "likes": 396
},
{
    "category": "Office Jokes", 
    "text": "A doctor and a lawyer are talking at a party. Their conversation is constantly interrupted by people describing their ailments and asking the doctor for free medical advice. After an hour of this, the exasperated doctor asks the lawyer, \"What do you do to stop people from asking you for legal advice when you're out of the office?\" \"I give it to them,\" replies the lawyer, \"and then I send them a bill.\" The doctor is shocked, but agrees to give it a try. The next day, still feeling slightly guilty, the doctor prepares the bills. When he goes to place them in his mailbox, he finds a bill from the lawyer.", 
    "identifier": "joke_4326Office Jokes", 
    "dislikes": 19, 
    "likes": 333
},
{
    "category": "Office Jokes", 
    "text": "Three doctors are discussing which types of patients they prefer. Doctor Watson says, ''I prefer librarians. All their organs are alphabetized.'' Doctor Fitzpatrick says, ''I prefer mathematicians. All their organs are numbered.'' Doctor Ahn says, ''I prefer lawyers. They’re gutless, heartless, brainless, spineless, and their heads and rear-ends are interchangeable.''", 
    "identifier": "joke_3435Office Jokes", 
    "dislikes": 59, 
    "likes": 291
},
{
    "category": "Political Jokes", 
    "text": "A little boy goes to his dad and asks, \"What is politics?\" The dad says, \"Well son, let me try to explain it this way: I'm the breadwinner of the family, so let's call me capitalism. Your mother, she's the administrator of the money, so we'll call her the government. We're here to take care of your needs, so we'll call you the people. The nanny, we'll consider her the working class. And your baby brother, we'll call him the future. Now, think about that and see if that makes sense.\" The little boy goes off to bed thinking about what dad had said. Later that night, he hears his baby brother crying, so he gets up to check on him. He finds that the baby has soiled his diaper. The little boy goes to his parents' room and finds his mother sound asleep. Not wanting to wake her, he goes to the nanny's room. Finding the door locked, he peeks in the keyhole and sees his father in bed with the nanny. He gives up and goes back to bed. The next morning, the little boy says to his father, \"Dad, I think I understand the concept of politics now.\" The father says, \"Good son, tell me in your own words what you think politics is all about.\" The little boy replies, \"Well, while capitalism is screwing the working class, the government is sound asleep, the people are being ignored and the future is in deep shit.\"", 
    "identifier": "joke_19203Political Jokes", 
    "dislikes": 70, 
    "likes": 696
},
{
    "category": "Political Jokes", 
    "text": "When asked if they would have sex with Bill Clinton, 86% of women in D.C. said, \"Not again.\"", 
    "identifier": "joke_5869Political Jokes", 
    "dislikes": 59, 
    "likes": 423
},
{
    "category": "Political Jokes", 
    "text": "Q: Why is England the wettest country? A: Because so many kings and queens have been reigning there.", 
    "identifier": "joke_16262Political Jokes", 
    "dislikes": 436, 
    "likes": 421
},
{
    "category": "Political Jokes", 
    "text": "A worldwide survey was conducted by the UN. The only question asked was: \"Would you please give your honest opinion about solutions to the food shortage in the rest of the world?\" The survey was a huge failure. In Africa they didn't know what \"food\" meant. In Eastern Europe they didn't know what \"honest\" meant. In Western Europe they didn't know what \"shortage\" meant. In China they didn't know what \"opinion\" meant. In the Middle East they didn't know what \"solution\" meant. In South America they didn't know what \"please\" meant. And in the USA they didn't know what \"the rest of the world\" meant.", 
    "identifier": "joke_21150Political Jokes", 
    "dislikes": 78, 
    "likes": 382
},
{
    "category": "Political Jokes", 
    "text": "Q: How many politicians does it take to change a light bulb? A: Two: one to change it and another one to change it back again.", 
    "identifier": "joke_6842Political Jokes", 
    "dislikes": 134, 
    "likes": 337
},
{
    "category": "Pop Culture Jokes", 
    "text": "Q: What's the difference between Usain Bolt and Hitler? A: Usain Bolt can finish a race.", 
    "identifier": "joke_19977Pop Culture Jokes", 
    "dislikes": 575, 
    "likes": 699
},
{
    "category": "Pop Culture Jokes", 
    "text": "I had a broken vacuum, then I put a One Direction sticker on it and it suddenly sucked again.", 
    "identifier": "joke_19969Pop Culture Jokes", 
    "dislikes": 258, 
    "likes": 595
},
{
    "category": "Pop Culture Jokes", 
    "text": "Yo mama so ugly the Walking Dead wouldn't walk with her.", 
    "identifier": "joke_15756Pop Culture Jokes", 
    "dislikes": 197, 
    "likes": 529
},
{
    "category": "Pop Culture Jokes", 
    "text": "20 years ago we had Johnny Cash, Bob Hope, and Steve Jobs. Now we have no cash, no hope, and no jobs.", 
    "identifier": "joke_19916Pop Culture Jokes", 
    "dislikes": 104, 
    "likes": 493
},
{
    "category": "Pop Culture Jokes", 
    "text": "I don't really like watching basketball, I just watch it to find out who the next member of the Kardashian family will be.", 
    "identifier": "joke_5180Pop Culture Jokes", 
    "dislikes": 171, 
    "likes": 366
},
{
    "category": "Racist Jokes", 
    "text": "I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\"", 
    "identifier": "joke_12362Racist Jokes", 
    "dislikes": 1233, 
    "likes": 7874
},
{
    "category": "Racist Jokes", 
    "text": "A black Jewish boy runs home from school one day and asks his father, “Daddy, am I more Jewish or more black?” The dad replies, “Why do you want to know, son?” “Because a kid at school is selling a bike for $50 and I want to know if I should talk him down to $40 or just steal it!”", 
    "identifier": "joke_4093Racist Jokes", 
    "dislikes": 2393, 
    "likes": 7356
},
{
    "category": "Racist Jokes", 
    "text": "A black boy walks into the kitchen where his mother is baking and accidentally pulls the flour over onto his head. He turns to his mother and says, “Look Mama, I’m a white boy!” His mother smacks him and says, “Go tell your Daddy what you just said!” The boy finds his father and says, “Look Daddy, I’m a white boy!” His Daddy bends him over, spanks him, stands the boy back up, and says, “Now, what do you have to say for yourself?” The boy replies, “I’ve only been a white boy for five minutes and I already hate you black people!”", 
    "identifier": "joke_3067Racist Jokes", 
    "dislikes": 1035, 
    "likes": 6413
},
{
    "category": "Racist Jokes", 
    "text": "Q: How do Chinese people name their babies? A: They throw them down the stairs to see what noise they make.", 
    "identifier": "joke_6236Racist Jokes", 
    "dislikes": 2485, 
    "likes": 6214
},
{
    "category": "Racist Jokes", 
    "text": "Q: Why do Mexicans eat beans for dinner? A: So they can take bubble baths.", 
    "identifier": "joke_6059Racist Jokes", 
    "dislikes": 2795, 
    "likes": 5162
},
{
    "category": "Relationship Jokes", 
    "text": "Ralph is driving home one evening, when he suddenly realizes that it's his daughter's birthday and he hasn't bought her a present. He drives to the mall, runs to the toy store, and says to the shop assistant, \"How much is that Barbie in the window?\" In a condescending manner, she says, \"Which Barbie?\" She continues, \"We have Barbie Goes to the Gym for $19.95, Barbie Goes to the Ball for $19.95, Barbie Goes Shopping for $19.95, Barbie Goes to the Beach for $19.95, Barbie Goes Nightclubbing for $19.95, and Divorced Barbie for $265.00.\" Ralph asks, \"Why is the Divorced Barbie $265.00 when all the others are only $19.95?\" \"That's obvious,\" the saleslady says. \"Divorced Barbie comes with Ken's house, Ken's car, Ken's boat, Ken's furniture...\"", 
    "identifier": "joke_4227Relationship Jokes", 
    "dislikes": 299, 
    "likes": 2214
},
{
    "category": "Relationship Jokes", 
    "text": "After Brian proposed to Jill, his father took him to one side. “Son, when I first got married to your mother, the first thing I did when we got home was take off my pants. I gave them to your mother and told her to try them on, which she did. They were huge on her and she said that she couldn’t wear them because they were too large. I said to her, 'Of course they are too big for you, I wear the pants in this family and I always will.' Ever since that day, son, we have never had a single problem.\" Brian took his dad’s advice and did the same thing to his wife on his wedding night. Then, Jill took off her panties and gave them to Brian. “Try these on,” she said. Brian went along with it and tried them on, but they were far too small. “What’s the point of this? I can’t get into your panties,” said Brian. “Exactly,” Jill replied, “and if you don’t change your attitude, you never will!”", 
    "identifier": "joke_4105Relationship Jokes", 
    "dislikes": 323, 
    "likes": 2066
},
{
    "category": "Relationship Jokes", 
    "text": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"", 
    "identifier": "joke_13483Relationship Jokes", 
    "dislikes": 343, 
    "likes": 1746
},
{
    "category": "Relationship Jokes", 
    "text": "Q: Is Google male or female? A: Female, because it doesn't let you finish a sentence before making a suggestion.", 
    "identifier": "joke_20014Relationship Jokes", 
    "dislikes": 459, 
    "likes": 1639
},
{
    "category": "Relationship Jokes", 
    "text": "Wife: \"In my dream, I saw you in a jewelry store and you bought me a diamond ring.\" Husband: \"I had the same dream and I saw your dad paying the bill.\"", 
    "identifier": "joke_16324Relationship Jokes", 
    "dislikes": 337, 
    "likes": 1444
},
{
    "category": "Religious Jokes", 
    "text": "A bus full of ugly people had a head on collision with a truck. When they died, God granted all of them one wish. The first person said, \"I want to be gorgeous.\" God snapped his fingers and it happened. The second person said the same thing and God did the same thing. This want on and on throughout the group. God noticed the last man in line was laughing hysterically. By the time God got to the last ten people, the last man was laughing and rolling on the ground. When the man's turn came, he laughed and said, \"I wish they were all ugly again.\"", 
    "identifier": "joke_7752Religious Jokes", 
    "dislikes": 217, 
    "likes": 1640
},
{
    "category": "Religious Jokes", 
    "text": "On their way to get married, a young Catholic couple is involved in a fatal car accident. The couple found themselves sitting outside the Pearly Gates waiting for St. Peter to process them into Heaven. While waiting, they began to wonder: Could they possibly get married in Heaven? When St. Peter showed up, they asked him. St. Peter said, \"I don't know. This is the first time anyone has asked. Let me go find out,'\" and he left. The couple sat and waited, and waited. Two months passed and the couple were still waiting. While waiting, they began to wonder what would happen if it didn't work out; could you get a divorce in heaven? After yet another month, St. Peter finally returned, looking somewhat bedraggled. \"Yes,\" he informed the couple, \"You can get married in Heaven.\" \"Great!\" said the couple, \"But we were just wondering, what if things don't work out? Could we also get a divorce in Heaven?\" St. Peter, red-faced with anger, slammed his clipboard onto the ground. \"What's wrong?\" asked the frightened couple. \"OH, COME ON!,\" St. Peter shouted, \"It took me three months to find a priest up here! Do you have any idea how long it'll take me to find a lawyer?\"", 
    "identifier": "joke_12819Religious Jokes", 
    "dislikes": 189, 
    "likes": 1104
},
{
    "category": "Religious Jokes", 
    "text": "Mother superior tells two new nuns that they have to paint their room without getting any paint on their clothes. One nun suggests to the other, \"Hey, let's take all our clothes off, fold them up, and lock the door.\" So they do this, and begin painting their room. Soon they hear a knock at the door. They ask, \"Who is it?\" \"Blind man!\" The nuns look at each other and one nun says, \"He's blind, so he can't see. What could it hurt?\" They let him in. The blind man walks in and says, \"Hey, nice tits. Where do you want me to hang the blinds?\"", 
    "identifier": "joke_13660Religious Jokes", 
    "dislikes": 182, 
    "likes": 1086
},
{
    "category": "Religious Jokes", 
    "text": "Jesus, Moses, and an old man go golfing. The first one to tee off is Moses. He smashes the ball and it is heading right for the water hazard before the green. Moses raises his club, the water parts, and the ball makes it to the green. Jesus gets up to swing, cranks it out, and it is headed for the water hazard. Jesus closes his eyes and prays. The ball skips across the water and lands on the green two feet from the hole. The old man's turn comes and he drives the ball. The ball looks like it is going to drop directly into the water. A fish jumps from the water hazard swallowing the ball, as an eagle drops from the sky, grabbing the fish. As the eagle flies over the green, a bolt of lightning strikes the eagle, making it drop the fish. As the fish hits the green, it spits out the ball and the ball falls into the hole, making a hole in one. Jesus looks at Moses and says, \"I really think I'm leaving Dad at home next time!\"", 
    "identifier": "joke_3122Religious Jokes", 
    "dislikes": 250, 
    "likes": 1079
},
{
    "category": "Religious Jokes", 
    "text": "A man gets on a bus, and ends up sitting next to a very attractive nun. Enamored with her, he asks if he can have sex with her. Naturally, she says no, and gets off the bus. The man goes to the bus driver and asks him if he knows of a way for him to have sex with the nun. \"Well,\" says the bus driver, \"every night at 8 o'clock, she goes to the cemetery to pray. If you dress up as God, I'm sure you could convince her to have sex with you.\" The man decides to try it, and dresses up in his best God costume. At eight, he sees the nun and appears before her. \"Oh, God!\" she exclaims. \"Take me with you!\" The man tells the nun that she must first have sex with him to prove her loyalty. The nun says yes, but tells him she prefers anal sex. Before you know it, they're getting down to it, having nasty, grunty, loud sex. After it's over, the man pulls off his God disguise. \"Ha, ha!\" he says, \"I'm the man from the bus!\" \"Ha, ha!\" says the nun, removing her costume, \"I'm the bus driver!\"", 
    "identifier": "joke_11311Religious Jokes", 
    "dislikes": 176, 
    "likes": 1069
},
{
    "category": "School Jokes", 
    "text": "School is like a boner. It's long and hard unless you're Asian.", 
    "identifier": "joke_8801School Jokes", 
    "dislikes": 969, 
    "likes": 3399
},
{
    "category": "School Jokes", 
    "text": "At school, Little Johnny's classmate tells him that most adults are hiding at least one dark secret, so it's very easy to blackmail them by saying, \"I know the whole truth.\" Little Johnny decides to go home and try it out. Johnny's mother greets him at home, and he tells her, \"I know the whole truth.\" His mother quickly hands him $20 and says, \"Just don't tell your father.\" Quite pleased, the boy waits for his father to get home from work, and greets him with, \"I know the whole truth.\" The father promptly hands him $40 and says, \"Please don't say a word to your mother.\" Very pleased, the boy is on his way to school the next day when he sees the mailman at his front door. The boy greets him by saying, \"I know the whole truth.\" The mailman immediately drops the mail, opens his arms, and says, \"Then come give your Daddy a great big hug!\"", 
    "identifier": "joke_4183School Jokes", 
    "dislikes": 395, 
    "likes": 3129
},
{
    "category": "School Jokes", 
    "text": "Josey wasn't the best pupil at Sunday school. She often fell asleep and one day while she was sleeping, the teacher asked her a question. \"Who is the creator of the universe?\" Joe was sitting next to Josey and decided to poke her with a pin to wake her up. Josey jumped and yelled, \"God almighty!\" The teacher congratulated her. A little later the teacher asked her another question, \"Tell me who is our lord and savior?\" Joe poked Josey again and she yelled out, \"Jesus Christ!\" The teacher congratulated her again. Later on the teacher asked, \"What did Eve say to Adam after their 26th child?\" Joe poked Josey again and she shouted, \"If you stick that thing in me again, I'll snap it in half and stick it up your ass!\"", 
    "identifier": "joke_10726School Jokes", 
    "dislikes": 351, 
    "likes": 2594
},
{
    "category": "School Jokes", 
    "text": "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\" Johnny: \"Seven.\" Teacher: \"No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven.\" Teacher: \"Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?\" Johnny: \"Six.\" Teacher: \"Good. Now if I gave you two cats, and another two cats and another two, how many would you have?\" Johnny: \"Seven!\" Teacher: \"Johnny, where in the heck do you get seven from?!\" Johnny: \"Because I've already got a freaking cat!\"", 
    "identifier": "joke_14190School Jokes", 
    "dislikes": 236, 
    "likes": 2462
},
{
    "category": "School Jokes", 
    "text": "A science teacher tells his class, \"Oxygen is a must for breathing and life. It was discovered in 1773.\" A blonde student responds, \"Thank God I was born after 1773! Otherwise I would have died without it.\"", 
    "identifier": "joke_4597School Jokes", 
    "dislikes": 487, 
    "likes": 2205
},
{
    "category": "Science Jokes", 
    "text": "Q: Why can't you trust an atom? A: Because they make up everything.", 
    "identifier": "joke_8376Science Jokes", 
    "dislikes": 83, 
    "likes": 403
},
{
    "category": "Science Jokes", 
    "text": "Helium walks into a bar and asks for a drink. The bartender says, \"Sorry, we don't serve noble gases here.\" Helium doesn't react.", 
    "identifier": "joke_14097Science Jokes", 
    "dislikes": 157, 
    "likes": 380
},
{
    "category": "Science Jokes", 
    "text": "When Magnesium and Oxygen started dating I was like, \"O MG!\"", 
    "identifier": "joke_16891Science Jokes", 
    "dislikes": 100, 
    "likes": 290
},
{
    "category": "Science Jokes", 
    "text": "Molecule 1: I just lost an electron. Molecule 2: Are you sure? Molecule 1: I’m positive.", 
    "identifier": "joke_5870Science Jokes", 
    "dislikes": 60, 
    "likes": 279
},
{
    "category": "Science Jokes", 
    "text": "I would make another chemistry joke, but they ARGON.", 
    "identifier": "joke_19968Science Jokes", 
    "dislikes": 177, 
    "likes": 231
},
{
    "category": "Sex Jokes", 
    "text": "I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\"", 
    "identifier": "joke_12362Sex Jokes", 
    "dislikes": 1233, 
    "likes": 7874
},
{
    "category": "Sex Jokes", 
    "text": "After picking her son up from school one day, the mother asks him what he did at school. The kid replies, \"I had sex with my teacher.\" She gets so mad that when they get home, she orders him to go straight to his room. When the father returns home that evening, the mother angrily tells him the news of what their son had done. As the father hears the news, a huge grin spreads across his face. He walks to his son's room and asks him what happened at school, the son tells him, \"I had sex with my teacher.\" The father tells the boy that he is so proud of him, and he is going to reward him with the bike he has been asking for. On the way to the store, the dad asks his son if he would like to ride his new bike home. His son responds, \"No thanks Dad, my butt still hurts.\"", 
    "identifier": "joke_3024Sex Jokes", 
    "dislikes": 3549, 
    "likes": 7088
},
{
    "category": "Sex Jokes", 
    "text": "A man and woman had been married for 30 years, and in those 30 years, they always left the lights off when having sex. He was embarrassed and scared that he couldn't please her, so he always used a big dildo on her. All these years she had no clue. One day, she decided to reach over and flip the light switch on and saw that he was using a dildo. She said \"I knew it, asshole, explain the dildo!\" He said, \"Explain the kids!\"", 
    "identifier": "joke_2303Sex Jokes", 
    "dislikes": 857, 
    "likes": 6284
},
{
    "category": "Sex Jokes", 
    "text": "A boy says to a girl, \"So, sex at my place?\" \"Yeah!\" \"Okay, but I sleep in a bunk bed with my younger brother, and he thinks we're making sandwiches, so we have to have a code. Cheese means faster and tomato means harder, okay?\" Later on the girl is yelling, \"Cheese cheese, tomato tomato!\" The younger brother says, \"Stop making sandwiches! You're getting mayo all over my bed!\"", 
    "identifier": "joke_4567Sex Jokes", 
    "dislikes": 765, 
    "likes": 6062
},
{
    "category": "Sex Jokes", 
    "text": "Sarah goes to school, and the teacher says, \"Today we are going to learn multi-syllable words, class. Does anybody have an example of a multi-syllable word?\" Sarah waves her hand, \"Me, Miss Rogers, me, me!\" Miss Rogers says, \"All right, Sarah, what is your multi-syllable word?\" Sarah says, \"Mas-tur-bate.\" Miss Rogers smiles and says, \"Wow, Sarah, that's a mouthful.\" Sarah says, \"No, Miss Rogers, you're thinking of a blowjob.\"", 
    "identifier": "joke_3565Sex Jokes", 
    "dislikes": 1242, 
    "likes": 5455
},
{
    "category": "Sexist Jokes", 
    "text": "How did the medical community come up with the term \"PMS\"? \"Mad Cow Disease\" was already taken.", 
    "identifier": "joke_6062Sexist Jokes", 
    "dislikes": 1257, 
    "likes": 2426
},
{
    "category": "Sexist Jokes", 
    "text": "A man asks, “God, why did you make woman so beautiful?” God responded, ”So you would love her.” The man asks, “But God, why did you make her so dumb?” God replied, “So she would love you.”", 
    "identifier": "joke_2346Sexist Jokes", 
    "dislikes": 366, 
    "likes": 1828
},
{
    "category": "Sexist Jokes", 
    "text": "A tough looking group of hairy bikers are riding when they see a girl about to jump off a bridge, so they stop. The leader, a big burly man, gets off his bike and says, \"What are you doing?\" \"I'm going to commit suicide,\" she says. While he doesn’t want to appear insensitive, he also doesn’t want to miss an opportunity, so he asks, \"Well, before you jump, why don't you give me a kiss?\" She does, and it is a long, deep, lingering kiss. After she's finished, the tough, hairy biker says, \"Wow! That was the best kiss I’ve ever had! That's a real talent you’re wasting. You could be famous. Why are you committing suicide?\" \"My parents don't like me dressing up like a girl…\"", 
    "identifier": "joke_4333Sexist Jokes", 
    "dislikes": 210, 
    "likes": 1768
},
{
    "category": "Sexist Jokes", 
    "text": "Q: Is Google male or female? A: Female, because it doesn't let you finish a sentence before making a suggestion.", 
    "identifier": "joke_20014Sexist Jokes", 
    "dislikes": 459, 
    "likes": 1639
},
{
    "category": "Sexist Jokes", 
    "text": "For all the guys who think a woman's place is in the kitchen, remember that's where the knives are kept.", 
    "identifier": "joke_5751Sexist Jokes", 
    "dislikes": 661, 
    "likes": 1514
},
{
    "category": "Sports Jokes", 
    "text": "Q: What do you call a bench full of white people? A: The MLB.", 
    "identifier": "joke_7527Sports Jokes", 
    "dislikes": 407, 
    "likes": 899
},
{
    "category": "Sports Jokes", 
    "text": "Q: What's the difference between England and a teabag? A: A teabag could stay in the cup for longer.", 
    "identifier": "joke_12254Sports Jokes", 
    "dislikes": 265, 
    "likes": 892
},
{
    "category": "Sports Jokes", 
    "text": "A Giants fan, a Padre fan, and a Dodger fan are climbing a mountain and arguing about who loves his team more. The Padre fan insists he's the most loyal. \"This is for San Diego!\" he yells and jumps off the side of the mountain. Not to be outdone, the Giants fan is next to profess his love for his team. He yells, \"This is for San Francisco!\" and pushes the Dodger fan off the mountain.", 
    "identifier": "joke_3658Sports Jokes", 
    "dislikes": 148, 
    "likes": 842
},
{
    "category": "Sports Jokes", 
    "text": "Q: Why did the golfer wear two pairs of pants? A: In case he got a hole in one.", 
    "identifier": "joke_12441Sports Jokes", 
    "dislikes": 73, 
    "likes": 845
},
{
    "category": "Sports Jokes", 
    "text": "How many snowboarders does it take to screw in a lightbulb? 50: 3 to die trying, 1 to actually pull it off, and 46 other to say, \"man, I could do that!\"", 
    "identifier": "joke_6316Sports Jokes", 
    "dislikes": 259, 
    "likes": 846
},
{
    "category": "Technology Jokes", 
    "text": "Your momma is so stupid she put airbags on her computer in case it crashed.", 
    "identifier": "joke_7600Technology Jokes", 
    "dislikes": 220, 
    "likes": 886
},
{
    "category": "Technology Jokes", 
    "text": "Q: What do computers eat for a snack? A: Microchips!", 
    "identifier": "joke_14020Technology Jokes", 
    "dislikes": 288, 
    "likes": 637
},
{
    "category": "Technology Jokes", 
    "text": "Yo momma so fat when she registered for MySpace there was no space left.", 
    "identifier": "joke_11274Technology Jokes", 
    "dislikes": 189, 
    "likes": 538
},
{
    "category": "Technology Jokes", 
    "text": "Mother: \"Sweetie, make a Christmas wish.\" Girl: \"I wish that Santa will send some clothes to those naked girls in papa's computer.\"", 
    "identifier": "joke_20120Technology Jokes", 
    "dislikes": 75, 
    "likes": 348
},
{
    "category": "Technology Jokes", 
    "text": "The energizer bunny was arrested on a charge of battery.", 
    "identifier": "joke_14816Technology Jokes", 
    "dislikes": 144, 
    "likes": 344
},
{
    "category": "Word Play Jokes", 
    "text": "A teacher asked her students to use the word \"beans\" in a sentence. \"My father grows beans,\" said one girl. \"My mother cooks beans,\" said a boy. A third student spoke up, \"We are all human beans.\"", 
    "identifier": "joke_13188Word Play Jokes", 
    "dislikes": 721, 
    "likes": 2127
},
{
    "category": "Word Play Jokes", 
    "text": "Q: What do you call a bear with no teeth? A: A gummy bear.", 
    "identifier": "joke_6014Word Play Jokes", 
    "dislikes": 502, 
    "likes": 2086
},
{
    "category": "Word Play Jokes", 
    "text": "A blonde and a redhead have a ranch. They have just lost their bull. The women need to buy another, but only have $500. The redhead tells the blonde, \"I will go to the market and see if I can find one for under that amount. If I can, I will send you a telegram.\" She goes to the market and finds one for $499. Having only one dollar left, she goes to the telegraph office and finds out that it costs one dollar per word. She is stumped on how to tell the blonde to bring the truck and trailer. Finally, she tells the telegraph operator to send the word \"comfortable.\" Skeptical, the operator asks, \"How will she know to come with the trailer from just that word?\" The redhead replies, \"She's a blonde so she reads slow: 'Come for ta bull.'\"", 
    "identifier": "joke_17102Word Play Jokes", 
    "dislikes": 262, 
    "likes": 1823
},
{
    "category": "Word Play Jokes", 
    "text": "A lady comes home from her doctor's appointment grinning from ear to ear. Her husband asks, \"Why are you so happy?\" The wife says, \"The doctor told me that for a forty-five year old woman, I have the breasts of a eighteen year old.\" \"Oh yeah?\" quipped her husband, \"What did he say about your forty-five year old ass?\" She said, \"Your name never came up in the conversation.\"", 
    "identifier": "joke_13483Word Play Jokes", 
    "dislikes": 343, 
    "likes": 1746
},
{
    "category": "Word Play Jokes", 
    "text": "Instead of \"the John,\" I call my toilet \"the Jim.\" That way it sounds better when I say I go to the Jim first thing every morning.", 
    "identifier": "joke_13130Word Play Jokes", 
    "dislikes": 260, 
    "likes": 1732
},
{
    "category": "Yo Momma Jokes", 
    "text": "Your momma is so ugly she made One Direction go another direction.", 
    "identifier": "joke_6032Yo Momma Jokes", 
    "dislikes": 2559, 
    "likes": 8667
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma is so fat when she sat on WalMart, she lowered the prices.", 
    "identifier": "joke_5987Yo Momma Jokes", 
    "dislikes": 1999, 
    "likes": 8216
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma's so stupid, she put two quarters in her ears and thought she was listening to 50 Cent.", 
    "identifier": "joke_3279Yo Momma Jokes", 
    "dislikes": 2136, 
    "likes": 7559
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma is so stupid when an intruder broke into her house, she ran downstairs, dialed 9-1-1 on the microwave, and couldn't find the \"CALL\" button.", 
    "identifier": "joke_6025Yo Momma Jokes", 
    "dislikes": 2057, 
    "likes": 7451
},
{
    "category": "Yo Momma Jokes", 
    "text": "Yo momma's so fat, that when she fell, no one was laughing but the ground was cracking up.", 
    "identifier": "joke_125Yo Momma Jokes", 
    "dislikes": 1202, 
    "likes": 7367
}]
