[{
    "text": "\r\n                Yo momma is so fat, I took a picture of her last Christmas and it's still printing.", 
    "dislikes": 9286, 
    "likes": 40481
},
{
    "text": "\r\n                Yo momma is so fat when she got on the scale it said, \"I need your weight not your phone number.\"", 
    "dislikes": 8554, 
    "likes": 33932
},
{
    "text": "\r\n                Yo momma is so fat that when she went to the beach a whale swam up and sang, \"We are family, even though you're fatter than me.\"", 
    "dislikes": 8608, 
    "likes": 25090
},
{
    "text": "\r\n                Yo mamma is so ugly when she tried to join an ugly contest they said, \"Sorry, no professionals.\"", 
    "dislikes": 7001, 
    "likes": 24336
},
{
    "text": "\r\n                Yo momma's so fat and old when God said, \"Let there be light,\" he asked your mother to move out of the way.", 
    "dislikes": 7608, 
    "likes": 21537
},
{
    "text": "\r\n                Your mama is so ugly that when I told her to do the robot, R2-D2 got herpes.", 
    "dislikes": 219, 
    "likes": 115
},
{
    "text": "\r\n                Paddy and Murphy are havin' a pint in the pub, when some scuba divers come on the TV.  Paddy says, \"Murphy, why is it them deep sea divers always sit on the side of the boat with them air tanks on their backs, and fall backwards out of the boat?\" Murphy thinks for a minute then says, \"That's easy. It's 'cos if they fell forwards, they'd still be in the friggin boat!\"", 
    "dislikes": 65, 
    "likes": 129
},
{
    "text": "\r\n                Q: Why couldn't the leopard play hide and seek?  A: Because he was always spotted.", 
    "dislikes": 73, 
    "likes": 250
},
{
    "text": "\r\n                There's a blond and a brunette in a car. The brunette is driving while the blonde is in the passenger seat. They're going down a steep hill when the brunette realizes that the brakes don't work. The brunette tells the blonde that the brakes don't work and they will drive off the side of the cliff because they failed to stop. The blonde then replies, \"Don't worry! There's a stop sign ahead.\"", 
    "dislikes": 92, 
    "likes": 169
},
{
    "text": "\r\n                There were two cannibals who captured a man. They decided it would be fair if they started eating from opposite ends. After a few minutes, the one who started at the head asked the other one, \"How's it going down there?\" And the other one replies, \"I'm having a ball!\"", 
    "dislikes": 73, 
    "likes": 149
},
{
    "text": "\r\n                There was once a blonde woman on a plane to Detroit. She was in the economy class, but after takeoff, she saw an empty seat in first class and moved there. An attendant saw her and said, \"Excuse me, ma'am, but you have a ticket for economy class, not first. You cannot stay here.\" The blonde replied, \"I can and I will.\" The attendant told the copilot, who came and talked to the woman. \"Ma'am, we really can't have you staying in this seat, your ticket was for economy.\" \"You can't make me move.\" The copilot told the captain, who tried to talk her out of the seat but it didn't work. Finally, a man who had heard what had been going on told the attendant to let him have a go at getting the woman out of the seat because he was married to a blonde too, so he knew how to deal with her. After a quick chat with her, she moved. The shocked attendant asked him how he did it. The man replied, \"I told her first class wasn't going to Detroit.\"", 
    "dislikes": 40, 
    "likes": 205
},
{
    "text": "\r\n                Q: Why can't orphans play baseball?  A: Because they don't know where home is.", 
    "dislikes": 130, 
    "likes": 69
},
{
    "text": "\r\n                The words election and erection are spelled similarly. They both have the same meaning too: a dick rising to power.", 
    "dislikes": 33, 
    "likes": 89
},
{
    "text": "\r\n                Q: Why did Adele cross the road?  A: To sing, \"Hello from the other side!\"", 
    "dislikes": 99, 
    "likes": 281
},
{
    "text": "\r\n                Yo mamma's so stupid, she thought Free Willy was a porno film.", 
    "dislikes": 139, 
    "likes": 110
},
{
    "text": "\r\n                Q.  What can you give and keep at the same time? A.  A cold!", 
    "dislikes": 74, 
    "likes": 157
},
{
    "text": "\r\n                ''Doctor, my nose is 11 inches long!\" ''Come back when it grows into a foot!\"", 
    "dislikes": 91, 
    "likes": 93
},
{
    "text": "\r\n                Q.  What did the pop star do when he locked himself out?  A.  He sang until he found the right key!", 
    "dislikes": 87, 
    "likes": 169
},
{
    "text": "\r\n                Q.  Why do anime fans listen to the radio in the morning?  A.  Because they enjoy car toons!", 
    "dislikes": 126, 
    "likes": 89
},
{
    "text": "\r\n                Q.  Why did the apple run away?  A.  Because the banana split!", 
    "dislikes": 80, 
    "likes": 171
},
{
    "text": "\r\n                Q.  What is the color of the wind?  A.  Blew.", 
    "dislikes": 57, 
    "likes": 188
},
{
    "text": "\r\n                Q.  What's a shark's favorite sandwich?  A.  Peanut butter and jellyfish!", 
    "dislikes": 48, 
    "likes": 80
},
{
    "text": "\r\n                Yo mama's hair is so full of dandruff, when she shook her head, the principal called a snow day.", 
    "dislikes": 72, 
    "likes": 141
},
{
    "text": "\r\n                Have you heard the story of the magic sandwich? Never mind, it's just a bunch of bologna.", 
    "dislikes": 119, 
    "likes": 113
},
{
    "text": "\r\n                Q: What do you get when you cross a fish and an elephant?  A: Swimming trunks.", 
    "dislikes": 91, 
    "likes": 166
},
{
    "text": "\r\n                A woman gets on a bus with her baby. The bus driver says, \"That's the ugliest baby that I've ever seen. Ugh!\" The woman goes to the rear of the bus and sits down, fuming. She says to a man next to her, \"The driver just insulted me!\" The man says, \"You go right up there and tell him off – go ahead, I'll hold your monkey for you.\"             Featured on June 08, 2016", 
    "dislikes": 1344, 
    "likes": 5039
},
{
    "text": "\r\n                What happens to a frog's car when it breaks down? It gets toad away.", 
    "dislikes": 4157, 
    "likes": 12034
},
{
    "text": "\r\n                Q: What did the duck say when he bought lipstick? A: \"Put it on my bill.\"", 
    "dislikes": 3148, 
    "likes": 7518
},
{
    "text": "\r\n                A boy is selling fish on a corner. To get his customers' attention, he is yelling, \"Dam fish for sale! Get your dam fish here!\" A pastor hears this and asks, \"Why are you calling them 'dam fish.'\" The boy responds, \"Because I caught these fish at the local dam.\" The pastor buys a couple fish, takes them home to his wife, and asks her to cook the dam fish. The wife responds surprised, \"I didn't know it was acceptable for a preacher to speak that way.\" He explains to her why they are dam fish. Later at the dinner table, he asks his son to pass the dam fish. He responds, \"That's the spirit, Dad! Now pass the f*cking potatoes!\"", 
    "dislikes": 1614, 
    "likes": 6168
},
{
    "text": "\r\n                Q. What did the elephant say to the naked man? A. \"How do you breathe through something so small?\"", 
    "dislikes": 1837, 
    "likes": 3213
},
{
    "text": "\r\n                There was a papa mole, a momma mole, and a baby mole. They lived in a hole out in the country near a farmhouse. Papa mole poked his head out of the hole and said, \"Mmmm, I smell sausage!\" Momma mole poked her head outside the hole and said, \"Mmmm, I smell pancakes!\" Baby mole tried to stick his head outside but couldn't because of the two bigger moles. Baby mole said, \"The only thing I smell is molasses.\"", 
    "dislikes": 1244, 
    "likes": 2348
},
{
    "text": "\r\n                A blonde, a redhead, and a brunette were all lost in the desert. They found a lamp and rubbed it. A genie popped out and granted them each one wish. The redhead wished to be back home. Poof! She was back home. The brunette wished to be at home with her family. Poof! She was back home with her family. The blonde said, \"Awwww, I wish my friends were here.\"", 
    "dislikes": 2048, 
    "likes": 15124
},
{
    "text": "\r\n                Blonde: \"What does IDK stand for?\" \r\nBrunette: \"I don’t know.\" \r\nBlonde: \"OMG, nobody does!\"", 
    "dislikes": 2118, 
    "likes": 12455
},
{
    "text": "\r\n                Two blondes fell down a hole. One said, \"It's dark in here isn't it?\" The other replied, \"I don't know; I can't see.\"", 
    "dislikes": 1584, 
    "likes": 11761
},
{
    "text": "\r\n                Q: Why can't a blonde dial 911? A: She can't find the eleven.", 
    "dislikes": 1846, 
    "likes": 10486
},
{
    "text": "\r\n                There was a blonde, a redhead, and a brunette. They were all trapped on an island and the nearest shore was 50 miles away. The redhead swam trying to make it to the other shore she swam 15 miles, drowned, and died. The brunette swam 24 miles, drowned, and died. The blonde swam 25 miles, got tired, and swam back.", 
    "dislikes": 1719, 
    "likes": 10481
},
{
    "text": "\r\n                Q: How do Chinese people name their babies?  A: They throw them down the stairs to see what noise they make.", 
    "dislikes": 2485, 
    "likes": 6211
},
{
    "text": "\r\n                Q: What's the difference between a Jew and a boy scout? A: A boy scout comes home from camp.", 
    "dislikes": 4057, 
    "likes": 4115
},
{
    "text": "\r\n                Q: What's the difference between a black man and a park bench?  A: A park bench can support a family of four.", 
    "dislikes": 2638, 
    "likes": 3016
},
{
    "text": "\r\n                How do you starve a black person? Put their food stamp card under their workboots!", 
    "dislikes": 2019, 
    "likes": 1752
},
{
    "text": "\r\n                I was at my bank today waiting in a short line. There was just one lady in front of me, an Asian lady, who was trying to exchange yen for dollars. It was obvious she was a little irritated. She asked the teller, \"Why it change? Yesterday, I get two hunat dolla of yen. Today I only get hunat eighty? Why it change?\"\r\n\r\nThe teller shrugged his shoulders and said, \"Fluctuations.\" The Asian lady says, \"Fluc you white people too!\"", 
    "dislikes": 489, 
    "likes": 1468
},
